{"apiMessage": "This JSON was provided by Springer Nature", "query": "subject:\"Data Mining and Knowledge Discovery\"", "apiKey": "9e4f8b01ac9095a31fd621b759df65f4", "result": [{"total": "113646", "start": "1", "pageLength": "100", "recordsDisplayed": "100"}], "records": [{"contentType": "Article", "identifier": "doi:10.1007/s10618-020-00734-4", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10618-020-00734-4"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10618-020-00734-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10618-020-00734-4"}], "title": "A framework for deep constrained clustering", "creators": [{"creator": "Zhang, Hongjing"}, {"creator": "Zhan, Tianyang"}, {"creator": "Basu, Sugato"}, {"creator": "Davidson, Ian"}], "publicationName": "Data Mining and Knowledge Discovery", "openaccess": "false", "doi": "10.1007/s10618-020-00734-4", "publisher": "Springer", "publicationDate": "2021-01-17", "publicationType": "Journal", "issn": "1384-5810", "eIssn": "1573-756X", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": "OriginalPaper", "startingPage": "1", "endingPage": "28", "journalId": "10618", "onlineDate": "2021-01-17", "copyright": "©2021 The Author(s), under exclusive licence to Springer Science+Business Media LLC, part of Springer Nature", "abstract": "The area of constrained clustering has been extensively explored by researchers and used by practitioners. Constrained clustering formulations exist for popular algorithms such as k-means, mixture models, and spectral clustering but have several limitations. A fundamental strength of deep learning is its flexibility, and here we explore a deep learning framework for constrained clustering and in particular explore how it can extend the field of constrained clustering. We show that our framework can not only handle standard together/apart constraints (without the well documented negative effects reported earlier) generated from labeled side information but more complex constraints generated from new types of side information such as continuous values and high-level domain knowledge. Furthermore, we propose an efficient training paradigm that is generally applicable to these four types of constraints. We validate the effectiveness of our approach by empirical results on both image and text datasets. We also study the robustness of our framework when learning with noisy constraints and show how different components of our framework contribute to the final performance. Our source code is available at: http://github.com/blueocean92 .", "conferenceInfo": [], "keyword": ["Constrained clustering", "Deep learning", "Representation learning", "Semi-supervised learning"]}, {"contentType": "Article", "identifier": "doi:10.1007/s41666-020-00083-3", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s41666-020-00083-3"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s41666-020-00083-3"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s41666-020-00083-3"}], "title": "What Are People Concerned About During the Pandemic? Detecting Evolving Topics about COVID-19 from Twitter", "creators": [{"creator": "Chang, Chia-Hsuan"}, {"creator": "Monselise, Michal"}, {"creator": "Yang, Christopher C."}], "publicationName": "Journal of Healthcare Informatics Research", "openaccess": "false", "doi": "10.1007/s41666-020-00083-3", "publisher": "Springer", "publicationDate": "2021-01-17", "publicationType": "Journal", "issn": "2509-4971", "eIssn": "2509-498X", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Collection on COVID-19", "genre": ["OriginalPaper", "Research Article"], "startingPage": "1", "endingPage": "28", "journalId": "41666", "onlineDate": "2021-01-17", "copyright": "©2021 The Author(s), under exclusive licence to Springer Nature Switzerland AG part of Springer Nature", "abstract": "With the novel coronavirus (COVID-19) pandemic affecting the lives of the citizens of over 200 countries, there is a need for policy makers and clinicians to understand public sentiment and track the spread of the disease. One of the sources for gaining valuable insight into public sentiment is through social media. This study aims to extract this insight by producing a list of the most discussed topics regarding COVID-19 on Twitter every week and monitoring the evolution of topics from week to week. This research will propose two topic mining that can handle a large-scale dataset—rolling online non-negative matrix factorization (Rolling-ONMF) and sliding online non-negative matrix factorization (Sliding-ONMF)—and compare the insights produced by both techniques. Each algorithm produces 425 topics over the course of 17 weeks. However, topics that have not evolved from one week to the next beyond a certain evolution threshold are consolidated into a single topic. Since the topics produced by the Rolling-ONMF algorithm each week depend on the topics from the previous week, we find that the Sliding-ONMF algorithm produces more varied topics each week; however, the topics produced by the Rolling-ONMF algorithm contain keywords that appear more consistent with each other when reviewing the terms manually. We also observe that the Sliding-ONMF algorithm is able to capture events that have shorter time frames rather than ones that last throughout many months while the Rolling-ONMF algorithm detects more general themes due to a higher average evolution score which leads to more topic consolidation. We have also conducted a qualitative analysis and grouped the detected topics into themes. A number of important themes such as government policy, economic crisis, COVID-19-related updates, COVID-19-related events, prevention, vaccines and treatments, and COVID-19 testing are identified. These reflected the concerns related to the pandemic expressed in social media.", "conferenceInfo": [], "keyword": ["Coronavirus", "Twitter analysis", "Topic analysis", "Topic evolution detection", "Social monitoring"]}, {"contentType": "Article", "identifier": "doi:10.1007/s13278-020-00718-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s13278-020-00718-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s13278-020-00718-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s13278-020-00718-8"}], "title": "Modeling signed social networks using spectral embedding", "creators": [{"creator": "Zheng, Q."}, {"creator": "Skillicorn, D. B."}], "publicationName": "Social Network Analysis and Mining", "openaccess": "false", "doi": "10.1007/s13278-020-00718-8", "publisher": "Springer", "publicationDate": "2021-01-17", "publicationType": "Journal", "issn": "1869-5450", "eIssn": "1869-5469", "volume": "11", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "18", "journalId": "13278", "onlineDate": "2021-01-17", "coverDate": "2021-12", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag GmbH, AT part of Springer Nature", "abstract": "Social networks are often modeled by graphs, with nodes representing individuals and positively weighted edges representing the strength of the relationships between them. Working directly with such graphs is difficult, and it has become common to use spectral techniques that embed graphs in a geometry, and then work with the geometry instead. In a good embedding, edges that are heavily (positively) weighted, and so represent strong interactions, cause the vertices they connect to be embedded close to one another. However, in some social networks, there are also antagonistic relationships that are naturally represented by negatively weighted edges. The resulting graphs are called signed social networks. Clearly, an embedding of such a signed social network should place nodes connected by positively weighted edges close together, but nodes connected by negatively weighted edges far apart. Existing spectral techniques to embed signed graphs have serious drawbacks. We derive one unnormalized and two normalized spectral analysis methods for signed graphs and show, using real-world data, that they produce robust embeddings.", "conferenceInfo": [], "keyword": ["Spectral embedding", "Signed social networks", "Laplacians", "Antagonistic relationships"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05687-9", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05687-9"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05687-9"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05687-9"}], "title": "Perception consistency ultrasound image super-resolution via self-supervised CycleGAN", "creators": [{"creator": "Liu, Heng"}, {"creator": "Liu, Jianyong"}, {"creator": "Hou, Shudong"}, {"creator": "Tao, Tao"}, {"creator": "Han, Jungong"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05687-9", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on New Trends in Bio-Inspired Computing for Deep Learning Applications", "genre": ["OriginalPaper", "S.I.: New Trends of Neural Computing for Advanced Applications"], "startingPage": "1", "endingPage": "11", "journalId": "521", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Due to the limitations of sensors, the transmission medium, and the intrinsic properties of ultrasound, the quality of ultrasound imaging is always not ideal, especially its low spatial resolution. To remedy this situation, deep learning networks have been recently developed for ultrasound image super-resolution (SR) because of the powerful approximation capability. However, most current supervised SR methods are not suitable for ultrasound medical images because the medical image samples are always rare, and usually, there are no low-resolution (LR) and high-resolution (HR) training pairs in reality. In this work, based on self-supervision and cycle generative adversarial network, we propose a new perception consistency ultrasound image SR method, which only requires the LR ultrasound data and can ensure the re-degenerated image of the generated SR one to be consistent with the original LR image, and vice versa. We first generate the HR fathers and the LR sons of the test ultrasound LR image through image enhancement, and then make full use of the cycle loss of LR–SR–LR and HR–LR–SR and the adversarial characteristics of the discriminator to promote the generator to produce better perceptually consistent SR results. The evaluation of PSNR/IFC/SSIM, inference efficiency and visual effects under the benchmark CCA-US and CCA-US datasets illustrate our proposed approach is effective and superior to other state-of-the-art methods.", "conferenceInfo": [], "keyword": ["Ultrasound image super-resolution", "Self-supervision", "CycleGAN"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05609-9", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05609-9"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05609-9"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05609-9"}], "title": "L1-norm Laplacian support vector machine for data reduction in semi-supervised learning", "creators": [{"creator": "Zheng, Xiaohan"}, {"creator": "Zhang, Li"}, {"creator": "Xu, Zhiqiang"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05609-9", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on New Trends of Neural Computing for Advanced Applications", "genre": ["OriginalPaper", "S.I. : New Trends of Neural Computing for Advanced Applications"], "startingPage": "1", "endingPage": "18", "journalId": "521", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "As a semi-supervised learning method, Laplacian support vector machine (LapSVM) is popular. Unfortunately, the model generated by LapSVM has a poor sparsity. A sparse decision model has always been fascinating because it could implement data reduction and improve performance. To generate a sparse model of LapSVM, we propose an $$\\ell _1$$ ℓ 1 -norm Laplacian support vector machine ( $$\\ell _1$$ ℓ 1 -norm LapSVM), which replaces the $$\\ell _2$$ ℓ 2 -norm with the $$\\ell _1$$ ℓ 1 -norm in LapSVM. The $$\\ell _1$$ ℓ 1 -norm LapSVM has two techniques that can induce sparsity: the $$\\ell _1$$ ℓ 1 -norm regularization and the hinge loss function. We discuss two situations for the $$\\ell _1$$ ℓ 1 -norm LapSVM, linear and nonlinear ones. In the linear $$\\ell _1$$ ℓ 1 -norm LapSVM, the sparse decision model implies that features with nonzero coefficients are contributive. In other words, the linear $$\\ell _1$$ ℓ 1 -norm LapSVM can perform feature selection to achieve the goal of data reduction. Moreover, the nonlinear (kernel) $$\\ell _1$$ ℓ 1 -norm LapSVM can also implement data reduction in terms of sample selection. In addition, the optimization problem of the $$\\ell _1$$ ℓ 1 -norm LapSVM is a convex quadratic programming one. That is, the $$\\ell _1$$ ℓ 1 -norm LapSVM has a unique and global solution. Experimental results on semi-supervised classification tasks have shown a comparable performance of our $$\\ell _1$$ ℓ 1 -norm LapSVM.", "conferenceInfo": [], "keyword": ["Semi-supervised learning", "Support vector machine", "\n                     -norm regularization", "Laplacian regularization"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10618-020-00730-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10618-020-00730-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10618-020-00730-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10618-020-00730-8"}], "title": "User preference and embedding learning with implicit feedback for recommender systems", "creators": [{"creator": "Sidana, Sumit"}, {"creator": "Trofimov, Mikhail"}, {"creator": "Horodnytskyi, Oleh"}, {"creator": "Laclau, Charlotte"}, {"creator": "Maximov, Yury"}, {"creator": "Amini, Massih-Reza"}], "publicationName": "Data Mining and Knowledge Discovery", "openaccess": "false", "doi": "10.1007/s10618-020-00730-8", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "1384-5810", "eIssn": "1573-756X", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": "OriginalPaper", "startingPage": "1", "endingPage": "25", "journalId": "10618", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer Science+Business Media LLC, part of Springer Nature", "abstract": "In this paper, we propose a novel ranking framework for collaborative filtering with the overall aim of learning user preferences over items by minimizing a pairwise ranking loss. We show the minimization problem involves dependent random variables and provide a theoretical analysis by proving the consistency of the empirical risk minimization in the worst case where all users choose a minimal number of positive and negative items. We further derive a Neural-Network model that jointly learns a new representation of users and items in an embedded space as well as the preference relation of users over the pairs of items. The learning objective is based on three scenarios of ranking losses that control the ability of the model to maintain the ordering over the items induced from the users’ preferences, as well as, the capacity of the dot-product defined in the learned embedded space to produce the ordering. The proposed model is by nature suitable for implicit feedback and involves the estimation of only very few parameters. Through extensive experiments on several real-world benchmarks on implicit data, we show the interest of learning the preference and the embedding simultaneously when compared to learning those separately. We also demonstrate that our approach is very competitive with the best state-of-the-art collaborative filtering techniques proposed for implicit feedback.", "conferenceInfo": [], "keyword": ["Recommender systems", "User preference and embedding learning", "Learning-to- rank", "neural networks"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05591-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05591-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05591-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05591-2"}], "title": "Considering optimization of English grammar error correction based on neural network", "creators": [{"creator": "Hu, Liang"}, {"creator": "Tang, Yanling"}, {"creator": "Wu, Xinli"}, {"creator": "Zeng, Jincheng"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05591-2", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on Multi-modal Information Learning and Analytics on Big Data", "genre": ["OriginalPaper", "Special Issue on Multi-modal Information Learning and Analytics on Big Data"], "startingPage": "1", "endingPage": "13", "journalId": "521", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "English expression, language characteristics and usage norms are quite special, which is quite different from Chinese. This has special requirements for auxiliary teaching tools that use computer technology for English text processing. Based on neural network algorithm, this paper combines the actual needs of English grammar error correction to construct an English grammar error correction model based on neural network. In data processing, after feature selection, logistic regression model is used to analyze the influence of different features on article error correction. The article error correction incorporating word vector features mainly explores how to effectively express the features in English grammar error correction. In addition, this paper proposes two methods to optimize the feature representation in article error correction. One is to directly use the word vector corresponding to the word as a feature, replacing the original One-hot encoding, and the other uses a clustering method to compress the article features. Finally, this paper designs experiments to study the performance of the model constructed in this paper. The results obtained show that the model constructed in this paper has a certain effect.", "conferenceInfo": [], "keyword": ["Neural network", "English grammar", "Error correction model", "Machine learning"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05625-9", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05625-9"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05625-9"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05625-9"}], "title": "Permeability characteristics of bedrock fissures under disturbance conditions based on neural network", "creators": [{"creator": "Zhang, Yu-zhe"}, {"creator": "Wu, Xiong"}, {"creator": "Zhang, Xiao"}, {"creator": "Mei, Ao-shuang"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05625-9", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on 2020 International Conference on Machine Learning and Big Data Analytics for IoT Security and Privacy (SPIoT-2020)", "genre": ["OriginalPaper", "S.I. : SPIoT 2020"], "startingPage": "1", "endingPage": "11", "journalId": "521", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "During different periods of rock fracture engineering, the surrounding rock is subject to intermittent and periodic vibration disturbances of different degrees. This disturbance has a great influence on the permeability characteristics of bedrock fissures. The permeability characteristics of bedrock fissure permeability are the most important hydrogeological element of underground water-containing medium, and determining the stratum permeability is an important link to evaluate the hydrogeological conditions of the mining area. Therefore, this paper studies the permeability characteristics of bedrock fissures based on the disturbance of neural network. First, use the basic structure of the neural network to understand the method applied to the study of permeability characteristics of bedrock cracks; secondly, put forward the rock permeability model driven by coal mining to help the subsequent experimental design of various relevant factors after the bedrock cracks Finally, the stress intensity factor method at the tip of the fracture is used to calculate the permeability of the bedrock fracture. The experimental data shows that the infiltration rate tested in the first minute of the experiment is 5.5 * 10^−4 cm/s, which is equivalent to 12 times the stable infiltration rate. At 50 min after the start of the test, the infiltration rate dropped to 4.6 * 10^−4 cm/s, which was close to the stable infiltration rate. The experimental results show that under the disturbance condition of neural network, the infiltration rate of bedrock fissures is accelerated and the permeability is increased.", "conferenceInfo": [], "keyword": ["Neural network", "Permeability characteristics of bedrock cracks", "Disturbance conditions", "Stress intensity factor at the tip of the crack"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05670-4", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05670-4"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05670-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05670-4"}], "title": "A deep multi-source adaptation transfer network for cross-subject electroencephalogram emotion recognition", "creators": [{"creator": "Wang, Fei"}, {"creator": "Zhang, Weiwei"}, {"creator": "Xu, Zongfeng"}, {"creator": "Ping, Jingyu"}, {"creator": "Chu, Hao"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05670-4", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "13", "journalId": "521", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In real-world application of affective brain–computer interface (aBCI), individual differences across subjects and non-stationary characteristics of electroencephalogram (EEG) signals can cause data bias. Moreover, for new specific subject, the size of sample data is very small compared to that of existing subjects, which easily leads to overfitting in deep neural network training and reduces generalization performance of the network. In this paper, the deep multi-source adaptation transfer network (DMATN) is proposed for the new subjects in aBCI. In DMATN, the multi-source selection is employed to obtain the portion of existing EEG data mostly correlated with new subject and to decrease by two-fifth source data. To explore domain-invariant structures, deep adaptation network is used to map correlated source domain and the target domain (new subject) into reproducing kernel Hilbert space (RKHS) optimized by the multiple kernel variant of maximum mean discrepancies (MK-MMD). To more precisely predict the emotional state of the new subject, domain discriminator is applied in DMATN to make the data distribution of the two domains more similar. Finally, across-subject experiments on SEED dataset are conducted to evaluate the proposed method. The experimental results show that DMATN model can achieve the state-of-the-art performance of 84.46%, 83.32% and 84.90% in three sessions, respectively. It also shows great time efficiency in applications of aBCI.", "conferenceInfo": [], "keyword": ["Affective brain–computer interface", "Emotion recognition", "Transfer learning", "Electroencephalogram (EEG)"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05685-x", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05685-x"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05685-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05685-x"}], "title": "Full-state neural network observer-based hybrid quantum diagonal recurrent neural network adaptive tracking control", "creators": [{"creator": "Elkenawy, Ahmed"}, {"creator": "El-Nagar, Ahmad M."}, {"creator": "El-Bardini, Mohammad"}, {"creator": "El-Rabaie, Nabila M."}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05685-x", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "20", "journalId": "521", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "This study introduces a neural network (NN) adaptive tracking controller-based reinforcement learning (RL) scheme for unknown nonlinear systems. First, an observer using feed-forward NN (FFNN) is performed to estimate the controlled system states. Second, an adaptive control based on actor-critic RL is developed, in which a quantum diagonal recurrent neural network (QDRNN) is proposed to represent the critic and actor parts. The critic QDRNN is applied to perform the “strategic” utility function, and it is minimized by the actor QDRNN. The proposed adaptive tracking NN control guarantees the faster convergence due to the developed updated algorithm for the controller parameters, which is derived using the Lyapunov function. Simulation and practical results indicate the robustness of the proposed observer-based adaptive control relative to other existing controllers.", "conferenceInfo": [], "keyword": ["Actor-critic reinforcement learning", "Quantum diagonal neural network", "Lyapunov theorem"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05637-5", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05637-5"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05637-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05637-5"}], "title": "Application of ameliorated Harris Hawks optimizer for designing of low-power signed floating-point MAC architecture", "creators": [{"creator": "Sarma, Rajkumar"}, {"creator": "Bhargava, Cherry"}, {"creator": "Jain, Shruti"}, {"creator": "Kamboj, Vikram Kumar"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05637-5", "publisher": "Springer", "publicationDate": "2021-01-16", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "30", "journalId": "521", "onlineDate": "2021-01-16", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Recently established Harris Hawks optimization (HHO) has natural behaviour for finding an optimum solution in global search space without getting trapped in previous convergence. However, the exploitation phase of the current Harris Hawks optimizer algorithm is poor. In the present research, an improved version of the Harris Hawks optimization algorithm, which combined HHO with Particle Swarm Optimization and named as ameliorated Harris Hawks optimizer algorithm, has been proposed to find the solution of various optimization problems such as nonlinear, non-convex and highly constrained engineering design problem. In the proposed research, the exploitation phase of the existing HHO algorithm is improved using a particle swarm optimization algorithm and its performance tested for CEC2005, CECE2017 and CEC2018 benchmark problems. Also, discrete algorithms such as FFT algorithms, convolution and image processing algorithm use multiply and accumulate (MAC) unit as a critical component. The efficiency of a MAC is mainly dependent upon the speed of operation, power dissipation and chip area along with the complexity level of the circuit. In this research paper, a power-efficient signed floating-point MAC (SFMAC) is proposed using universal compressor-based multiplier (UCM). Instead of having a complex design architecture, a simple multiplexer-based circuit is used to achieve signed floating output. The 8 × 8 SFMAC can take 8-bit mantissa and 3-bit exponent. And therefore, the input to the SFMAC can be in the range of − (7.96875)_10 to + (7.96875)_10. The design and implementation of the proposed architecture is done on the Cadence Spectre tool in GPDK 90 nm and TSMC 130 nm technologies. The analysis has proved that the proposed SFMAC architecture has consumed the least power than the recent MAC architectures available in the literature.", "conferenceInfo": [], "keyword": ["Floating-point MAC", "UCM", "Cadence", "TSMC 130 nm", "GPDK 90 nm"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05658-0", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05658-0"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05658-0"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05658-0"}], "title": "A hybrid rolling grey framework for short time series modelling", "creators": [{"creator": "Cui, Zhesen"}, {"creator": "Wu, Jinran"}, {"creator": "Ding, Zhe"}, {"creator": "Duan, Qibin"}, {"creator": "Lian, Wei"}, {"creator": "Yang, Yang"}, {"creator": "Cao, Taoyun"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05658-0", "publisher": "Springer", "publicationDate": "2021-01-15", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "15", "journalId": "521", "onlineDate": "2021-01-15", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Time series modelling is gaining spectacular popularity in the prediction process of decision making, with applications including real-world management and engineering. However, for short time series, prediction has to face unavoidable limitation for modelling extremely complex systems. It has to apply inadequate and incomplete data from short time to predict unknown observations. With such limited data source, existing techniques, such as statistical modelling or machine learning methods, fail to predict short time series effectively. To address this problem, this paper provides a global framework for short time series modelling predictions, integrating the rolling mechanism, grey model, and meta-heuristic optimization algorithms. In addition, dragonfly algorithm and whale optimization algorithm are investigated and deployed to optimize the framework by enhancing its predicting accuracy with less computational costs. To verify the performance of the proposed framework, three industrial cases are introduced as simulation experiments in this paper. Experimental results confirm that the framework solves corresponding short time series modelling predictions with greater accuracy and speed than the standard GM(1,1) models. The source codes of this framework are available at: https://github.com/zhesencui/HybridRollingGreyFramework.git .", "conferenceInfo": [], "keyword": ["Short time series", "Rolling mechanism", "Grey model", "Meta-heuristic optimization algorithms", "Forecasting"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01532-6", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01532-6"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01532-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01532-6"}], "title": "Auto-labelling entities in low-resource text: a geological case study", "creators": [{"creator": "Enkhsaikhan, Majigsuren"}, {"creator": "Liu, Wei"}, {"creator": "Holden, Eun-Jung"}, {"creator": "Duuring, Paul"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01532-6", "publisher": "Springer", "publicationDate": "2021-01-15", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "21", "journalId": "10115", "onlineDate": "2021-01-15", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "Studies on named entity recognition (NER) often require a substantial amount of human-annotated training data. This makes technical domain-specific NER from industry data especially challenging as labelled data are scarce. Despite English as the surface language, technical jargon and writing conventions used in technical documents render the low-resource language challenges where techniques such as transfer learning hardly work. Relieving labour intensive annotations using automatic labelling is thus an important research topic, seeking ways to obtain labelled data quickly and consistently. In this work, we propose an iterative deep learning NER framework using distant supervision for automatic labelling of domain-specific datasets. The framework is applied to mineral exploration reports and produced a large BIO-annotated dataset with six geological categories. This quality-labelled dataset, OzROCK, is made publicly available to support future research on technical domain NER. Experimental results demonstrated the effectiveness of this approach, further confirmed by domain experts. The generalisation ability is verified by applying the framework to two other datasets: one for disease names and the other for chemical names. Overall, our approach can effectively reduce annotation efforts by identifying a much smaller subset, that is challenging for automatic labelling thus requires attention from human experts.", "conferenceInfo": [], "keyword": ["Geological named entity recognition", "Geological information extraction", "Sequence labelling"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05642-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05642-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05642-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05642-8"}], "title": "ESRE: handling repeated entities in distant supervised relation extraction", "creators": [{"creator": "Sun, Xin"}, {"creator": "Jiang, Jinghu"}, {"creator": "Shang, Yuming"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05642-8", "publisher": "Springer", "publicationDate": "2021-01-15", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "13", "journalId": "521", "onlineDate": "2021-01-15", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "Distant supervised relation extraction has been widely used to find novel relational facts from unstructured text. As far as we know, nearly all existing relation extraction models assume that each sentence contains precisely one entity pair, i.e., two entities. However, in reality, the datasets constructed by distant supervision have lots of sentences which contain repeated entities. In other words, there may be more than two entities in a sentence. This phenomenon breaks the assumption of existing models and makes them inevitably encounter the attention bias problem; that is, the model focuses on the wrong entities during relation extraction. To alleviate this problem, in this paper, we utilize the idea of ensemble learning and propose a novel distant supervised relation extraction model. The proposed model follows the multi-instance multi-label learning mechanism and conducts relation extraction based on the sentence-bag representations. Specifically, it first tries to identify the most critical entity and keywords, and then it uses voting mechanism to determine the sentence-level and bag-level features. Experimental results show that our proposed model outperforms the state-of-the-art baselines in relation extraction on a popular benchmark dataset, and it also indicates that the proposed model can indeed alleviate the problem caused by repeated-entity phenomenon.", "conferenceInfo": [], "keyword": ["Relation extraction", "Repeated entities", "Ensemble learning", "Voting-convolution", "Multi-instance multi-label learning"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01534-4", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01534-4"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01534-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01534-4"}], "title": "Natural language question answering over knowledge graph: the marriage of SPARQL query and keyword search", "creators": [{"creator": "Hu, Xin"}, {"creator": "Duan, Jiangli"}, {"creator": "Dang, Depeng"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01534-4", "publisher": "Springer", "publicationDate": "2021-01-15", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "26", "journalId": "10115", "onlineDate": "2021-01-15", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Natural language question answering over knowledge graph has received widespread attention. However, the existing methods always aim to improve every phase of natural language question answering and neglect the defects; namely, not all query intentions can be identified and mapped to the correct SPARQL statement. In contrast, keyword search relies on the links among multiple keywords regardless of the exact logic relations in question. Therefore, we propose a framework (abbreviated as NLQSK for title of this paper) that introduces keyword search into natural language question answering to compensate for the defects mentioned above. First, we translate a natural language question into top- k SPARQL statements by using the existing methods. Second, we transform the valuable information that cannot be identified and mapped into keywords, and then, return the neighboring information in a knowledge graph by keyword index. Third, we combine the SPARQL block (i.e., the SPARQL statement and its result) and keyword search to produce the answer to the natural language question. Finally, the experiments on the benchmark dataset confirm that keyword search can compensate for the defects of natural language question answering and that NLQSK can answer more questions than the existing state-of-the-art question answering systems.", "conferenceInfo": [], "keyword": ["Knowledge graph", "Question answering", "Natural language question answering", "SPARQL", "Keyword search"]}, {"contentType": "Article", "identifier": "doi:10.1007/s41019-020-00149-7", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s41019-020-00149-7"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s41019-020-00149-7"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s41019-020-00149-7"}], "title": "A Survey on Advancing the DBMS Query Optimizer: Cardinality Estimation, Cost Model, and Plan Enumeration", "creators": [{"creator": "Lan, Hai"}, {"creator": "Bao, Zhifeng"}, {"creator": "Peng, Yuwei"}], "publicationName": "Data Science and Engineering", "openaccess": "true", "doi": "10.1007/s41019-020-00149-7", "publisher": "Springer", "publicationDate": "2021-01-15", "publicationType": "Journal", "issn": "2364-1185", "eIssn": "2364-1541", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": "OriginalPaper", "startingPage": "1", "endingPage": "16", "journalId": "41019", "onlineDate": "2021-01-15", "copyright": "©2021 The Author(s)", "abstract": "Query optimizer is at the heart of the database systems. Cost-based optimizer studied in this paper is adopted in almost all current database systems. A cost-based optimizer introduces a plan enumeration algorithm to find a (sub)plan, and then uses a cost model to obtain the cost of that plan, and selects the plan with the lowest cost. In the cost model, cardinality, the number of tuples through an operator, plays a crucial role. Due to the inaccuracy in cardinality estimation, errors in cost model, and the huge plan space, the optimizer cannot find the optimal execution plan for a complex query in a reasonable time. In this paper, we first deeply study the causes behind the limitations above. Next, we review the techniques used to improve the quality of the three key components in the cost-based optimizer, cardinality estimation, cost model, and plan enumeration. We also provide our insights on the future directions for each of the above aspects.", "conferenceInfo": [], "keyword": ["Query optimizer", "Cardinality estimation", "Cost model", "Plan enumeration"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-021-00411-3", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-021-00411-3"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-021-00411-3"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-021-00411-3"}], "title": "Designing a relational model to identify relationships between suspicious customers in anti-money laundering (AML) using social network analysis (SNA)", "creators": [{"creator": "Shaikh, Abdul Khalique"}, {"creator": "Al-Shamli, Malik"}, {"creator": "Nazir, Amril"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-021-00411-3", "publisher": "Springer", "publicationDate": "2021-01-14", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "22", "journalId": "40537", "onlineDate": "2021-01-14", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "The stability of the economy and political system of any country highly depends on the policy of anti-money laundering (AML). If government policies are incapable of handling money laundering activities in an appropriate way, the control of the economy can be transferred to criminals. The current literature provides various technical solutions, such as clustering-based anomaly detection techniques, rule-based systems, and a decision tree algorithm, to control such activities that can aid in identifying suspicious customers or transactions. However, the literature provides no effective and appropriate solutions that could aid in identifying relationships between suspicious customers or transactions. The current challenge in the field is to identify associated links between suspicious customers who are involved in money laundering. To consider this challenge, this paper discusses the challenges associated with identifying relationships such as business and family relationships and proposes a model to identify links between suspicious customers using social network analysis (SNA). The proposed model aims to identify various mafias and groups involved in money laundering activities, thereby aiding in preventing money laundering activities and potential terrorist financing. The proposed model is based on relational data of customer profiles and social networking functions metrics to identify suspicious customers and transactions. A series of experiments are conducted with financial data, and the results of these experiments show promising results for financial institutions who can gain real benefits from the proposed model.", "conferenceInfo": [], "keyword": ["Social network analysis", "Anti-money laundering", "Relational analysis", "Relationships", "Customer profile"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05629-5", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05629-5"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05629-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05629-5"}], "title": "Neural network and fuzzy logic-based hybrid attitude controller designs of a fixed-wing UAV", "creators": [{"creator": "Ulus, Şaban"}, {"creator": "Eski, İkbal"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05629-5", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "23", "journalId": "521", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In this paper, a mini unmanned aerial vehicle (UAV) is planned to be used in applications such as spraying pesticide and weed control in agricultural areas. According to literature review, proportional + integral + derivative (PID) structure is used to control many of these UAVs. This controller is insufficient against uncertain weather conditions and disturbance effects. In this study, many different control techniques are evaluated to select the controller structure that can respond to these uncertainties. The structure having the best result was chosen as the UAV controller. Ultrastick-25e mini UAV model is used to control the roll and yaw angle lateral dynamics. State-space presentation of the UAV longitudinal and lateral dynamics is explained, and it is just obtained for the lateral dynamics to control the attitude of the UAV under 60 km/h flight velocity condition. According to the aileron and rudder inputs, lateral dynamics simulations have successfully done by using five different controller methods such as classical PID, artificial neuro-fuzzy inference system (ANFIS), fuzzy logic controller, combined ANFIS-PID, and PD-Fuzzy-PI controllers. Moreover, three different input signals are assumed to evaluate the system response. Additionally, transient response and the time performance parameters such as overshoots, peak, rise and settling times, and steady-state error have analyzed for the designed different controllers. The simulated results for the five different controller designs showed that combined PD-fuzzy-PI and ANFIS-PID controllers have more acceptable performance than other controllers at the steady level flight condition. It is aimed that the simulation findings obtained in this study will contribute to experimental studies.", "conferenceInfo": [], "keyword": ["ANFIS", "Fixed-wing UAV", "Fuzzy logic controller", "PID controller"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05680-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05680-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05680-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05680-2"}], "title": "An energy efficient intelligent torque vectoring approach based on fuzzy logic controller and neural network tire forces estimator", "creators": [{"creator": "Parra, Alberto"}, {"creator": "Zubizarreta, Asier"}, {"creator": "Pérez, Joshué"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05680-2", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "14", "journalId": "521", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In electric vehicles (EVs) with multiple motors, torque vectoring (TV) control can effectively enhance the cornering response and safety. Moreover, TV systems can also improve the overall efficiency through an optimal torque distribution that also considers the power consumption. For such a complex control system with multiple objectives, intelligent control techniques have demonstrated to be one of the best alternatives. However, the works proposed in the literature do not handle both vehicle dynamics behaviour and energy efficiency, and generally do not consider the real-time implementability of the developed controllers. To overcome the aforementioned issues, in this work, a novel torque vectoring approach is proposed, which uses a neural network-based vertical tire forces estimator and considers the regenerative braking capabilities of EVs. Moreover, the implementability of the controller in a hetereogenous (FPGA and microcontroller) automotive suitable system on chip is addressed, ensuring its real-time capabilities. For the sake of validating the proposed approach, a set of experiments have been carried out in a hardware in the loop setup. The performance of the proposed TV approach has been compared with other two TV approaches from the literature, evaluating them in several challenging manoeuvres in high and low tire-road friction coefficient scenarios. Results show that the proposed approach not only is able to enhance the vehicle dynamics behaviour but also to decrease the energy consumption about 13%.", "conferenceInfo": [], "keyword": ["Electric vehicles", "Torque vectoring", "Neural networks", "Intelligent control", "FPGA"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01529-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01529-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01529-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01529-1"}], "title": "L-ideals and rough sets based on L-ideals", "creators": [{"creator": "Estaji, Ali Akbar"}, {"creator": "Haghdadi, Toktam"}, {"creator": "Farokhi Ostad, Javad"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01529-1", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "27", "journalId": "10115", "onlineDate": "2021-01-13", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "Let D be a distributive lattice, and let L be a frame. In this article, we introduce the notion of L -ideals of D . We show that the set of all L -ideals of D is a distributive lattice, and some essential properties of this lattice are studied. Also, we discuss some special elements of this lattice. Moreover, we define a novel congruence relation for the concept of L -ideal of D . Finally, we study some properties of rough sets inherited from the congruence relation.", "conferenceInfo": [], "keyword": ["Rough set", "Distributive Lattice", "Frame", "\n                     -ideals", "Upper and Lower approximation", "06D72", "06B10", "06D22"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01536-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01536-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01536-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01536-2"}], "title": "Distributed processing of regular path queries in RDF graphs", "creators": [{"creator": "Guo, Xintong"}, {"creator": "Gao, Hong"}, {"creator": "Zou, Zhaonian"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01536-2", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "35", "journalId": "10115", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "SPARQL 1.1 offers a type of navigational query for RDF systems, called regular path query (RPQ). A regular path query allows for retrieving node pairs with the paths between them satisfying regular expressions. Regular path queries are always difficult to be evaluated efficiently because of the possible large search space. Thus there has been no scalable and practical solution so far. In this paper, we present Leon+, an in-memory distributed framework, to address the RPQ problem in the context of the knowledge graph. To reduce search space and mitigate mounting communication costs, Leon+ takes advantage of join-ahead pruning via a novel RDF summarization technique together with a path partitioning strategy. We also develop a subtle cost model to devise query plans to achieve high efficiency for complex RPQs. As there has been no available RPQ benchmark, we create micro-benchmarks on both synthetic and real-world datasets. A thorough experimental evaluation is presented between our approach and the state-of-the-art RDF stores. The results show that our approach outperforms 5x faster than the competitors on single RPQ. For query workload, it saves up to 1/2 time and 2/3 communication overheads over the baseline method.", "conferenceInfo": [], "keyword": ["Knowledge graph", "RDF/SPARQL", "Regular path queries", "Graph summarization", "Graph partitioning"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05662-4", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05662-4"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05662-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05662-4"}], "title": "Nonparametric method of topic identification using granularity concept and graph-based modeling", "creators": [{"creator": "Ganguli, Isha"}, {"creator": "Sil, Jaya"}, {"creator": "Sengupta, Nandita"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05662-4", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I. : 2019 India Intl. Congress on Computational Intelligence", "genre": ["OriginalPaper", "S.I. : 2019 India Intl. Congress on Computational Intelligence"], "startingPage": "1", "endingPage": "21", "journalId": "521", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "This paper aims to classify the large unstructured documents into different topics without involving huge computational resources and a priori knowledge. The concept of granularity is employed here to extract contextual information from the documents by generating granules of words (GoWs), hierarchically. The proposed granularity-based word grouping (GBWG) algorithm in a computationally efficient way group the words at different layers by using co-occurrence measure between the words of different granules. The GBWG algorithm terminates when no new GoW is generated at any layer of the hierarchical structure. Thus multiple GoWs are obtained, each of which contains contextually related words, representing different topics. However, the GoWs may contain common words and creating ambiguity in topic identification. Louvain graph clustering algorithm has been employed to automatically identify the topics, containing unique words by using mutual information as an association measure between the words (nodes) of each GoW. A test document is classified into a particular topic based on the probability of its unique words belong to different topics. The performance of the proposed method has been compared with other unsupervised, semi-supervised, and supervised topic modeling algorithms. Experimentally, it has been shown that the proposed method is comparable or better than the state-of-the-art topic modeling algorithms which further statistically verified with the Wilcoxon Rank-sum Test.", "conferenceInfo": [], "keyword": ["Granularity", "Point-wise mutual information", "Graph-based modeling", "Hierarchical structure", "Computationally efficient algorithm"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-021-00409-x", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-021-00409-x"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-021-00409-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-021-00409-x"}], "title": "SDPSO: Spark Distributed PSO-based approach for feature selection and cancer disease prognosis", "creators": [{"creator": "Tadist, Khawla"}, {"creator": "Mrabti, Fatiha"}, {"creator": "Nikolov, Nikola S."}, {"creator": "Zahi, Azeddine"}, {"creator": "Najah, Said"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-021-00409-x", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "22", "journalId": "40537", "onlineDate": "2021-01-13", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "The Dimensionality Curse is one of the most critical issues that are hindering faster evolution in several fields broadly, and in bioinformatics distinctively. To counter this curse, a conglomerate solution is needed. Among the renowned techniques that proved efficacy, the scaling-based dimensionality reduction techniques are the most prevalent. To insure improved performance and productivity, horizontal scaling functions are combined with Particle Swarm Optimization (PSO) based computational techniques. Optimization algorithms are an interesting substitute to traditional feature selection methods that are both efficient and relatively easier to scale. Particle Swarm Optimization (PSO) is an iterative search algorithm that has proved to achieve excellent results for feature selection problems. In this paper, a composite Spark Distributed approach to feature selection that combines an integrative feature selection algorithm using Binary Particle Swarm Optimization (BPSO) with Particle Swarm Optimization (PSO) algorithm for cancer prognosis is proposed; hence Spark Distributed Particle Swarm Optimization (SDPSO) approach. The effectiveness of the proposed approach is demonstrated using five benchmark genomic datasets as well as a comparative study with four state of the art methods. Compared with the four methods, the proposed approach yields the best in average of purity ranging from 0.78 to 0.97 and F-measure ranging from 0.75 to 0.96.", "conferenceInfo": [], "keyword": ["Big Data", "Spark", "Feature selection", "PSO algorithm", "Clustering", "Genomics", "Prognosis"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01538-0", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01538-0"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01538-0"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01538-0"}], "title": "Saliency-based YOLO for single target detection", "creators": [{"creator": "Hu, Jun-ying"}, {"creator": "Shi, C.-J. Richard"}, {"creator": "Zhang, Jiang-she"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01538-0", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "16", "journalId": "10115", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "At present, You only look once (YOLO) is the fastest real-time object detection system based on a unified deep neural network. During training, YOLO divides the input image to $$S \\times S $$ S × S gird cells and the only one grid cell that contains the center of an object, takes charge of detecting that object. It is not sure that the cell corresponding to the center of the object is the best choice to detect the object. In this paper, inspired by the visual saliency mechanism we introduce the saliency map to YOLO to develop YOLO3-SM method, where saliency map selects the grid cell containing the most salient part of the object to detect the object. The experimental results on two data sets show that the prediction box of YOLO3-SM obtains the lager IOU value, which demonstrates that compared with YOLO3 , the YOLO3-SM selects the cell that is more suitable to detect the object . In addition, YOLO3-SM gets the highest mAP that the other three state-of-the-art object detection methods on the two data sets, which shows that introducing the saliency map to YOLO can improve the detection performance.", "conferenceInfo": [], "keyword": ["Deep neural network", "Object detection", "Saliency map", "Visual saliency"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01539-z", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01539-z"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01539-z"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01539-z"}], "title": "Deep dynamic neural networks for temporal language modeling in author communities", "creators": [{"creator": "Delasalles, Edouard"}, {"creator": "Lamprier, Sylvain"}, {"creator": "Denoyer, Ludovic"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01539-z", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "25", "journalId": "10115", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Language models are at the heart of numerous works, notably in the text mining and information retrieval communities. These statistical models aim at extracting word distributions, from simple unigram models to recurrent approaches with latent variables that capture subtle dependencies in texts. However, those models are learned from word sequences only, and authors’ identities, as well as publication dates, are seldom considered. We propose a neural model, based on recurrent language modeling (e.g., LSTM), which aims at capturing language diffusion tendencies in author communities through time. By conditioning language models with author and dynamic temporal vector states, we are able to leverage the latent dependencies between the text contexts. The model captures language evolution of authors via a shared temporal prediction function in a latent space, which allows to handle a variety of modeling tasks, including completion and prediction of language models through time. Experiments show the performances of the approach, compared to several temporal and non-temporal language baselines on two real-world corpora.", "conferenceInfo": [], "keyword": ["Representation learning", "Dynamic language model", "Diachronic text analysis", "Deep learning"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01540-6", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01540-6"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01540-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01540-6"}], "title": "Efficient computation of deletion-robust k-coverage queries", "creators": [{"creator": "Zheng, Jiping"}, {"creator": "Huang, Xingnan"}, {"creator": "Ma, Yuan"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01540-6", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "31", "journalId": "10115", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Extracting a controllable subset from a large-scale dataset so that users can fully understand the entire dataset is a significant topic for multicriteria decision making. In recent years, this problem has been widely studied, and various query models have been proposed, such as top- k , skyline, k -regret and k -coverage queries. Among these models, the k -coverage query is an ideal query method; this model has stability, scale invariance and high traversal efficiency. However, current methods including k -coverage queries cannot deal with deleting some points from the dataset while providing an effective solution set efficiently. In this paper, we study the robustness of k -coverage queries in two cases involving the dynamic deletion of data points. The first case is when it is assumed that the whole dataset can be obtained in advance, while the second is when the data points arrive in a stream. For a centralized dataset, we introduce a sieving mechanism and use a precalculated threshold to filter a coreset from the entire dataset. Then, the k -coverage query can be carried out on this small coreset instead of the entire dataset, and we propose a threshold-based k -coverage query algorithm, which greatly accelerates query processing. For a streaming dataset, a special chain structure is adopted. Furthermore, a single-pass streaming algorithm named Robust-Sieving is proposed. Moreover, the coreset-based method is extended to answer the problem. In addition, sampling techniques are adopted to accelerate query processing under these two circumstances. Extensive experiments verify the effectiveness of our proposed Robust-Sieving algorithm and the coreset-based algorithms with or without sampling.", "conferenceInfo": [], "keyword": ["\n                     -coverage queries", "Representative skyline", "Sieving procedure", "Robust-Coreset", "Chain structure"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01541-5", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01541-5"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01541-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01541-5"}], "title": "RELINE: point-of-interest recommendations using multiple network embeddings", "creators": [{"creator": "Christoforidis, Giannis"}, {"creator": "Kefalas, Pavlos"}, {"creator": "Papadopoulos, Apostolos N."}, {"creator": "Manolopoulos, Yannis"}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01541-5", "publisher": "Springer", "publicationDate": "2021-01-13", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "27", "journalId": "10115", "onlineDate": "2021-01-13", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "The rapid growth of users’ involvement in Location-Based Social Networks has led to the expeditious growth of the data on a global scale. The need of accessing and retrieving relevant information close to users’ preferences is an open problem which continuously raises new challenges for recommendation systems. The exploitation of points-of-interest (POIs) recommendation by existing models is inadequate due to the sparsity and the cold start problems. To overcome these problems many models were proposed in the literature; however, most of them ignore important factors, such as: geographical proximity, social influence, or temporal and preference dynamics, which tackle their accuracy while personalize their recommendations. In this work, we investigate these problems and present a unified model that jointly learns user’s and POI dynamics. Our proposal is termed RELINE ( RE commendations with mu L t I ple N etwork E mbeddings). More specifically, RELINE captures: (i) the social , (ii) the geographical , (iii) the temporal influence , and (iv) the users’ preference dynamics , by embedding eight relational graphs into one shared latent space. We have evaluated our approach against state-of-the-art methods with three large real-world datasets in terms of accuracy. Additionally, we have examined the effectiveness of our approach against the cold-start problem. Performance evaluation results demonstrate that significant performance improvement is achieved in comparison to existing state-of-the-art methods.", "conferenceInfo": [], "keyword": ["POI recommendations", "Location-based social networks", "Temporal evolution", "Geographical dynamics", "Social influence"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05565-4", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05565-4"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05565-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05565-4"}], "title": "Artificial Neural Networks and Deep Learning in the Visual Arts: a review", "creators": [{"creator": "Santos, Iria"}, {"creator": "Castro, Luz"}, {"creator": "Rodriguez-Fernandez, Nereida"}, {"creator": "Torrente-Patiño, Álvaro"}, {"creator": "Carballal, Adrián"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05565-4", "publisher": "Springer", "publicationDate": "2021-01-12", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["ReviewPaper", "S. I : Neural Networks in Art, sound and Design"], "startingPage": "1", "endingPage": "37", "journalId": "521", "onlineDate": "2021-01-12", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In this article, we perform an exhaustive analysis of the use of Artificial Neural Networks and Deep Learning in the Visual Arts. We begin by introducing changes in Artificial Intelligence over the years and examine in depth the latest work carried out in prediction, classification, evaluation, generation, and identification through Artificial Neural Networks for the different Visual Arts. While we highlight the contributions of photography and pictorial art, there are also other uses for 3D modeling, including video games, architecture, and comics. The results of the investigations discussed show that the use of Artificial Neural Networks in the Visual Arts continues to evolve and have recently experienced significant growth. To complement the text, we include a glossary and table with information about the most commonly employed image datasets.", "conferenceInfo": [], "keyword": ["Artificial Neural Networks", "Generative Adversarial Networks", "Convolutional Neural Networks", "Deep Learning", "Visual Arts", "Machine Learning", "Prediction", "Classification", "Evaluation", "Generation", "Identification", "Transfer Learning", "Datasets"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05674-0", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05674-0"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05674-0"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05674-0"}], "title": "Brain storm optimization algorithm for solving knowledge spillover problems", "creators": [{"creator": "Cheng, Shi"}, {"creator": "Zhang, Mingming"}, {"creator": "Ma, Lianbo"}, {"creator": "Lu, Hui"}, {"creator": "Wang, Rui"}, {"creator": "Shi, Yuhui"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05674-0", "publisher": "Springer", "publicationDate": "2021-01-12", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on New Trends of Neural Computing for Advanced Applications", "genre": ["OriginalPaper", "S.I. : New Trends of Neural Computing for Advanced Applications"], "startingPage": "1", "endingPage": "14", "journalId": "521", "onlineDate": "2021-01-12", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "The evolutionary game theory aims to simulate different decision strategies in populations of individuals and to determine how the population evolves. Compared to strategies between two agents, such as cooperation or noncooperation, strategies on multiple agents are rather challenging and difficult to be simulated via traditional methods. Particularly, in a knowledge spillover problem (KSP), cooperation strategies among more than hundreds of individuals need to be simulated. At the same time, the brain storm optimization (BSO) algorithm, which is a data-driven and model-driven hybrid paradigm, has the potential to simulate the complex behaviors in a group of simple individuals. In this paper, a modified BSO algorithm has been used to solve KSP from the perspective of evolutionary game theory. Knowledge spillover (KS) is the sharing or exchanging of knowledge resources among individuals. Firstly, the KS and evolutionary game theory were introduced. Then, the KS model and KS optimization problems were built from the evolutionary game perspective. Lastly, the modified BSO algorithms were utilized to solve KS optimization problems. Based on the applications of BSO algorithms for KSP, the properties of different swarm optimization algorithms can be understood better. More efficient algorithms could be designed to solve different real-world evolutionary game problems.", "conferenceInfo": [], "keyword": ["Brain storm optimization", "Evolutionary game theory", "Knowledge spillover model", "Swarm optimization algorithm"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05607-x", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05607-x"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05607-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05607-x"}], "title": "An iterative gradient convolutional neural network and its application in endoscopic photoacoustic image formation from incomplete acoustic measurement", "creators": [{"creator": "Sun, Zheng"}, {"creator": "Wang, Xinyu"}, {"creator": "Yan, Xiangyang"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05607-x", "publisher": "Springer", "publicationDate": "2021-01-12", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "20", "journalId": "521", "onlineDate": "2021-01-12", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Endoscopic photoacoustic tomography (EPAT) is a rapidly developing catheter-based imaging technique to provide cross-sectional images of anatomical, functional and molecular data of tubular objects. The scanning geometry of the ultrasonic detector is enclosed in the cavity resulting in highly restricted acquisition of photoacoustically induced acoustic pressures. Thus, data-incompleteness is an important factor that causes degradation of the image quality. This work presents a method to solve the acoustic inverse problem of EPAT from incomplete measurements associated with the image formation process. This method combines the traditional variational iteration with convolutional neural network (CNN), in which the forward operator and adjoint operator of imaging are excluded from the network training and are embedded into each layer of the structural unit. The gradient information is utilized to reduce the influence of incomplete measurements on the image quality. The network is trained unit by unit in an adaptive way to achieve fast convergence. Our numerical results conducted on various data sets showed that the trained network is robust to the sampling rate of the measured data. Also, it is able to provide a generalization that can work across various noise levels in the data. In addition, a robust peak signal-to-noise ratio (PSNR) and structural similarity (SSIM) improvement obtained in the reconstructed images has been demonstrated in comparison with conventional TR reconstruction, CS reconstruction and post-processing by U-net.", "conferenceInfo": [], "keyword": ["Endoscopic photoacoustic tomography", "Image formation", "Incomplete measurement", "Convolutional neural network (CNN)"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05569-0", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05569-0"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05569-0"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05569-0"}], "title": "A robust model for domain recognition of acoustic communication using Bidirectional LSTM and deep neural network.", "creators": [{"creator": "Rathor, Sandeep"}, {"creator": "Agrawal, Sanket"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05569-0", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "10", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "This paper proposes a robust model for domain recognition of acoustic communication by using Bidirectional LSTM and deep neural network. The proposed model consists of five layers namely: speech recognition, word embedding, a layer of Bidirectional LSTM (BiLSTM) followed by two fully connected layers (FC). Initially, speech is recognized and resultant text is preprocessed before passing to the proposed model to obtain the domain of communication. Word embedding takes the padded sentence as the input sequence and outputs the encoded sentence. LSTM layer is used to capture the temporal features while fully connected layers (FC) are responsible to capture the linear and nonlinear combination of those features. We compared the performance of our proposed model to the conventional machine learning algorithms such as SVM, KNN, Random forest, and Gradient boosting and found that proposed model outperforms with high accuracy, i.e., 90.09%.", "conferenceInfo": [], "keyword": ["DNN", "BiLSTM", "LSTM domain recognition", "Domain classification", "Machine learning"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05683-z", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05683-z"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05683-z"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05683-z"}], "title": "A novel solution for finding postpartum haemorrhage using fuzzy neural techniques", "creators": [{"creator": "Kumar, V. D. Ambeth"}, {"creator": "Sharmila, S."}, {"creator": "Kumar, Abhishek"}, {"creator": "Bashir, A. K."}, {"creator": "Rashid, Mamoon"}, {"creator": "Gupta, Sachin Kumar"}, {"creator": "Alnumay, Waleed S."}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05683-z", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I: Deep Neuro-Fuzzy Analytics for Intelligent Big Data Processing in Smart Ecosystems", "genre": ["OriginalPaper", "S.I. : Deep Neuro-Fuzzy Analytics in Smart Ecosystems"], "startingPage": "1", "endingPage": "14", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Postpartum haemorrhage (PPH) is the loss of blood above 500 ml during vaginal or caesarean deliveries. It is difficult to find a PPH in an earlier stage, so pregnant women are exposed to excess blood loss that makes them suffer and die. Antenatal practices help in identifying risk factors, and modern technology is used to overcome the risk. Still, the morbidity rate and the mortality arise due to the unpredicted and unexpected cause. PPH is still a significant cause of maternal morbidity and mortality worldwide. The novelty of this research work is to alert medical practitioner about excessive bleeding of pregnant women during childbirth. We are proposing an automation system using wearable devices to prevent pregnant women from the PPH. These devices measure parameters like temperature, pulse rate, blood pressure, and sweat rate of pregnant women. Fuzzy neural technique-based rules are used for each parameter to predict the risk in developing PPH and to evaluate the performance of proposed system for reducing mortality and morbidity rates. Our findings of experiment are carried on metrics of HPPH (high-level postpartum haemorrhage), NPPH (normal-level postpartum haemorrhage), and MPPH (medium-level postpartum haemorrhage) for 15 patients. Fuzzy output value of 1 indicates patient state with NPPH, 0 indicates patient state with HPPH, and values in between 0 and 1 indicate MPPH. Based on the sensitivity of the predicted values, medical attention is taken from doctors or nurses in nearby locations using Internet of Things infrastructure.", "conferenceInfo": [], "keyword": ["Fuzzy", "Haemorrhage", "Hysterectomy", "Internet of things", "Mortality", "Postpartum", "Uterine atony"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05571-6", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05571-6"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05571-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05571-6"}], "title": "Kernel ridge regression model for sediment transport in open channel flow", "creators": [{"creator": "Safari, Mir Jafar Sadegh"}, {"creator": "Rahimzadeh Arashloo, Shervin"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05571-6", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "17", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Sediment transport modeling is of primary importance for the determination of channel design velocity in lined channels. This study proposes to model sediment transport in open channel flow using kernel ridge regression (KRR), a nonlinear regression technique formulated in the reproducing kernel Hilbert space. While the naïve kernel regression approach provides high flexibility for modeling purposes, the regularized variant is equipped with an additional mechanism for better generalization capability. In order to better tailor the KRR approach to the sediment transport modeling problem, unlike the conventional KRR approach, in this study the kernel parameter is directly learned from the data via a new gradient descent-based learning mechanism. Moreover, for model construction, a procedure based on Cholesky decomposition and forward-back substitution is applied to improve the computational complexity of the approach. Evaluation of the recommended technique is performed utilizing a large number of laboratory experimental data where the examination of the proposed approach in terms of three statistical performance indices for sediment transport modeling indicates a better performance for the developed model in particle Froude number computation, outperforming the conventional models as well as some other machine learning techniques.", "conferenceInfo": [], "keyword": ["Sediment transport", "Open channel", "Rigid boundary channel", "Kernel ridge regression", "Regularization"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05575-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05575-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05575-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05575-2"}], "title": "Retraction Note To: Artificial neural network to predict the effect of heat treatments on Vickers microhardness of low-carbon Nb microalloyed steels", "creators": [{"creator": "Khalaj, Gholamreza"}, {"creator": "Yoozbashizadeh, Hossein"}, {"creator": "Khodabandeh, Alireza"}, {"creator": "Nazari, Ali"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05575-2", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["Erratum", "Retraction Note"], "startingPage": "1", "endingPage": "1", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "The Editor-in-Chief has retracted this article [1] because it significantly overlaps with number of articles including those that were under consideration at the same time [2] and previously published articles [3–6]. Additionally, the article shows evidence of peer review manipulation.", "conferenceInfo": []}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05589-w", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05589-w"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05589-w"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05589-w"}], "title": "Robust visual tracker combining temporal consistent constraint and adaptive spatial regularization", "creators": [{"creator": "Zhang, Yi"}, {"creator": "Liu, Guixi"}, {"creator": "Zhang, Haoyang"}, {"creator": "Huang, Hanlin"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05589-w", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "20", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Existing discriminative correlation filters suffer from the defects of potential spatial distractors and the degradation of appearance model caused by hard-temporal correlation. Aiming at this issue, a robust tracker which combines the adaptive spatial regularization and the temporal consistent constraint is proposed in this paper. First, we propose to take the extracted saliency map of the background as a reference weight to construct the spatial regularization term, with which the perceived performance of the filter against distractors is enhanced by learning the spatial sparse constraint adaptively. Second, we further implement the temporal consistent regularization formed by capturing dynamic appearance information from multiple historical frames with a high-confidence strategy to mitigate the model degradation. Third, we employ the alternating direction method of multipliers to solve the constrained optimization problem efficiently, thereby the computational complexity can be reduced. The concrete experimental results on OTB-2013, OTB-2015, Temple-Color-128 and VOT2016 benchmarks demonstrate that our tracker outperforms several state-of-the-art algorithms.", "conferenceInfo": [], "keyword": ["Correlation filter tracking", "Temporal consistent constraint", "Adaptive spatial regularization", "High-confidence strategy"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05631-x", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05631-x"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05631-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05631-x"}], "title": "Tracking vital signs of a patient using channel state information and machine learning for a smart healthcare system", "creators": [{"creator": "Khan, Muhammad Imran"}, {"creator": "Jan, Mian Ahmad"}, {"creator": "Muhammad, Yar"}, {"creator": "Do, Dinh-Thuan"}, {"creator": "Rehman, Ateeq ur"}, {"creator": "Mavromoustakis, Constandinos X."}, {"creator": "Pallis, Evangelos"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05631-x", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on Data Fusion in the era of Data Science", "genre": ["OriginalPaper", "S.I. : Data Fusion in the era of Data Science"], "startingPage": "1", "endingPage": "15", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In a smart healthcare system, the sensor-embedded wearable devices have the ability to track various vital signs of a patient. However, such devices need to be worn by the patients all the time. These devices have limitations such as their battery lifetime, charging mechanism, and hardware-related cost. Moreover, these devices transmit a huge amount of redundant and inconsistent data. The transmitted data need to be fused to remove any outlier so that only highly- refined data are available for decision-making. In this paper, we use channel state information (CSI) to track the vital signs of a patient and remove any outliers from the gathered data. We monitor the respiration rate of a patient during sleep with minimal hardware-related cost. Our CSI-based approach no longer requires the patients to wear any wearables and can monitor even the minute fluctuations in a WiFi signal. For extracting useful features from the respiratory data, three types of feature extraction techniques are used. In order to select important features from the extracted feature space, three feature selection algorithms, i.e., Relief, mRMR, and Lasso, have been investigated. In addition, for predicting the health conditions of a patient, four machine learning classification algorithms, i.e., KNN, SVM, DT, and RF, are utilized. The use of CSI ensures that highly refined and fused data are available for feature selection, and the selected features are presented to the ML classification algorithms for predicting the health condition of the patient.", "conferenceInfo": [], "keyword": ["Smart healthcare system", "Channel state information", "Vital signs", "Data fusion", "Machine learning", "Classification", "Feature selection", "Feature extraction"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05645-5", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05645-5"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05645-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05645-5"}], "title": "Viscous dissipation and MHD hybrid nanofluid flow towards an exponentially stretching/shrinking surface", "creators": [{"creator": "Zainal, N. A."}, {"creator": "Nazar, R."}, {"creator": "Naganthran, K."}, {"creator": "Pop, I."}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05645-5", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "11", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "The impact of viscous dissipation in hybrid nanofluid plays a prominent role in industrial applications, for instance, in polymer processing flows and aerodynamic heating. Thus, the current investigation scrutinises the heat transfer performance of Al_2O_3–Cu/H_2O in the magnetohydrodynamics stagnation point flow towards an exponentially stretching/shrinking surface with a viscous dissipation effect. By adopting valid similarity transformations, the differential equations that consist of multivariable functions and their partial derivatives are transformed into a special case of ordinary differential equations. The reduced mathematical model is elucidated using the bvp4c procedure in MATLAB systems software. This approach of solving is proficient for supplying non-uniqueness solution when sufficient initial assumptions are delivered. The effects of different controlling parameters were examined, and the findings disclosed that the coefficient of skin friction and the local Nusselt number increase by addition of nanoparticles. In contrast, the inclusion of the viscous dissipation effect causes an increase in the thermal state of the fluid hence triggers the thermal boundary layer to upraise. The outcomes are evidenced to provide more than one solutions, whereby necessarily result in an analysis of solution stability that affirms the first solution’s viability.", "conferenceInfo": [], "keyword": ["Hybrid nanofluid", "Viscous dissipation", "MHD", "Exponentially shrinking sheet"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05572-5", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05572-5"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05572-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05572-5"}], "title": "DENet: a deep architecture for audio surveillance applications", "creators": [{"creator": "Greco, Antonio"}, {"creator": "Roberto, Antonio"}, {"creator": "Saggese, Alessia"}, {"creator": "Vento, Mario"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05572-5", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "12", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In the last years, a big interest of both the scientific community and the market has been devoted to the design of audio surveillance systems, able to analyse the audio stream and to identify events of interest; this is particularly true in security applications, in which the audio analytics can be profitably used as an alternative to video analytics systems, but also combined with them. Within this context, in this paper we propose a novel recurrent convolutional neural network architecture, named DENet; it is based on a new layer that we call denoising-enhancement (DE) layer, which performs denoising and enhancement of the original signal by applying an attention map on the components of the band-filtered signal. Differently from state-of-the-art methodologies, DENet takes as input the lossless raw waveform and is able to automatically learn the evolution of the frequencies-of-interest over time, by combining the proposed layer with a bidirectional gated recurrent unit. Using the feedbacks coming from classifications related to consecutive frames (i.e. that belong to the same event), the proposed method is able to drastically reduce the misclassifications. We carried out experiments on the MIVIA Audio Events and MIVIA Road Events public datasets, confirming the effectiveness of our approach with respect to other state-of-the-art methodologies.", "conferenceInfo": [], "keyword": ["Audio surveillance", "Deep learning", "Signal processing"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05622-y", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05622-y"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05622-y"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05622-y"}], "title": "Composite adaptive fuzzy decentralized tracking control for pure-feedback interconnected large-scale nonlinear systems", "creators": [{"creator": "Cui, Yang"}, {"creator": "Liu, Xiaoping"}, {"creator": "Deng, Xin"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05622-y", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "17", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "This paper focuses on a problem of composite adaptive fuzzy decentralized tracking control for a class of uncertain pure-feedback interconnected large-scale nonlinear systems with unmeasurable states. A fuzzy state observer is designed by using fuzzy logic systems; thus, the unmeasurable states of pure-feedback nonlinear systems are estimated based on the designed fuzzy state observer. A serial–parallel estimation model is designed by using the fuzzy state observer. To avoid the analytic computation, the command filters are employed to produce the command signals and their derivatives. The fuzzy adaptive laws are constructed by using prediction errors and compensating tracking errors. Finally, a controller is constructed by dynamic surface control technique. Through the proposed control method, all the signals in the closed-loop system are bounded, and the output of the system can track the given reference signal. The simulation studies verify the effectiveness of the proposed control method in this paper.", "conferenceInfo": [], "keyword": ["Pure-feedback nonlinear systems", "Interconnection item", "Backstepping control", "Adaptive tracking control", "Fuzzy state observer", "Lyapunov function"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05671-3", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05671-3"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05671-3"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05671-3"}], "title": "Brain tumor classification in magnetic resonance image using hard swish-based RELU activation function-convolutional neural network", "creators": [{"creator": "Alhassan, Afnan M."}, {"creator": "Zainon, Wan Mohd Nazmee Wan"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05671-3", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "13", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Automatic classification of brain tumor types is essential to accelerate the treatment process and increase the patient’s survival rate. In today’s world, magnetic resonance imaging is used for determining the brain tumor types in an effective manner. The manual classification of brain tumor consumes more time and also applicable for a limited number of images, so a deep learning-based model is proposed in this research paper for automatic classification of brain tumor types. At first, the brain images are collected from T1-weighted contrast-enhanced magnetic resonance image dataset. Then, the normalization technique and histogram of oriented gradients are employed to improve the visible level of the collected raw brain images and to extract the feature vectors from the normalized brain images. The histogram descriptor effectively describes the edge and contour features of the images related to other feature descriptors. Further, the extracted features are given as the input to convolutional neural networks to classify meningiomas, gliomas, and pituitary tumors. The hard swish-based RELU activation function is included in convolutional neural networks that effectively improve the classification performance and learning speed. In the experimental phase, the proposed model achieved 98.6% of accuracy that is better compared to the existing algorithms like deep convolutional neural network with transfer learning and fine-tuning.", "conferenceInfo": [], "keyword": ["Convolutional neural network", "Hard swish-based RELU activation function", "A histogram of oriented gradients", "Image normalization", "Magnetic resonance imaging"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05567-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05567-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05567-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05567-2"}], "title": "Pricing policy on a dual competitive channel for a green product under fuzzy conditions", "creators": [{"creator": "Jamali, Mohammad-Bagher"}, {"creator": "Gorji, Mohammad-Ali"}, {"creator": "Iranpoor, Mehdi"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05567-2", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "13", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Due to the growth of community awareness, the popularity of green products has increased. In addition, with increasing Internet usage, companies use the Internet as a direct channel along with the traditional way to sell and distribute their products through retailers. This paper investigates pricing in a supply chain consisting of a manufacturer and a retailer with two distribution channels, direct (Internet) and indirect (retailer). The decision variables of the manufacturer are wholesale price and greening level of the product, while the retail price is the decision variable of the retailer. Due to the existence of uncertain conditions in the real world, this problem has been modeled by fuzzy parameters. A game theory approach is employed to provide equilibrium solutions for cooperative and non-cooperative scenarios. Finally, a numerical analysis is presented, and a sensitivity analysis is investigated. For example, it is concluded that vertical cooperation in the supply chain, in addition to increasing the entire supply chain profit, increases the product greenness level and thus improves the environment.", "conferenceInfo": [], "keyword": ["Pricing", "Green supply chain", "Fuzzy theory", "Game theory"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00392-9", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00392-9"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00392-9"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00392-9"}], "title": "Deep Learning applications for COVID-19", "creators": [{"creator": "Shorten, Connor"}, {"creator": "Khoshgoftaar, Taghi M."}, {"creator": "Furht, Borko"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00392-9", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Survey Paper"], "startingPage": "1", "endingPage": "54", "journalId": "40537", "onlineDate": "2021-01-11", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "This survey explores how Deep Learning has battled the COVID-19 pandemic and provides directions for future research on COVID-19. We cover Deep Learning applications in Natural Language Processing, Computer Vision, Life Sciences, and Epidemiology. We describe how each of these applications vary with the availability of big data and how learning tasks are constructed. We begin by evaluating the current state of Deep Learning and conclude with key limitations of Deep Learning for COVID-19 applications. These limitations include Interpretability, Generalization Metrics, Learning from Limited Labeled Data, and Data Privacy. Natural Language Processing applications include mining COVID-19 research for Information Retrieval and Question Answering, as well as Misinformation Detection, and Public Sentiment Analysis. Computer Vision applications cover Medical Image Analysis, Ambient Intelligence, and Vision-based Robotics. Within Life Sciences, our survey looks at how Deep Learning can be applied to Precision Diagnostics, Protein Structure Prediction, and Drug Repurposing. Deep Learning has additionally been utilized in Spread Forecasting for Epidemiology. Our literature review has found many examples of Deep Learning systems to fight COVID-19. We hope that this survey will help accelerate the use of Deep Learning for COVID-19 research.", "conferenceInfo": [], "keyword": ["COVID-19", "Deep Learning applications", "Natural Language Processing", "Computer Vision", "Life Sciences", "Epidemiology"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05652-6", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05652-6"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05652-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05652-6"}], "title": "A dual deep neural network with phrase structure and attention mechanism for sentiment analysis", "creators": [{"creator": "Rao, Dongning"}, {"creator": "Huang, Sihong"}, {"creator": "Jiang, Zhihua"}, {"creator": "Deverajan, Ganesh Gopal"}, {"creator": "Patan, Rizwan"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05652-6", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "12", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Sentiment analysis of short texts is difficult for their simplicity and compactness. This goes a step further when it comes to the Chinese texts. Although deep learning achieved better accuracy in sentiment analysis, there is a lack of explain-ability. Thus, this paper evaluates the effectiveness of techniques for sentiment analysis of Chinese short financial texts with deep learning. For this, we built a Chinese short financial texts corpus ( CSFC ) and designed an ablation experiment. Beside the CFSC , we used a Chinese review collection and an English short-text repository in the experiment for comparison. There are five techniques involved. They are the Pinyin, the segmentation, the lexical analysis, the phrase structure and the attention mechanism. As results, we found that the phrase structure and the attention mechanism are two of the best. Therefore, the best model in the experiment is called a Phrase Structure and Attention-based Deep network model ( PhraSAD ). Moreover, to improve the classification accuracy on neutral data, we use a dual classifier strategy for 3-class problems. Experimental results showed that PhraSAD outperformed all other compared models on all experimental datasets.", "conferenceInfo": [], "keyword": ["Sentiment analysis", "Chinese short text", "Deep learning", "Phrase structure", "Attention", "Dual classifier"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05656-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05656-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05656-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05656-2"}], "title": "Designing mm-wave electromagnetic engineered surfaces using generative adversarial networks", "creators": [{"creator": "Mohammadjafari, Sanaz"}, {"creator": "Ozyegen, Ozan"}, {"creator": "Cevik, Mucahit"}, {"creator": "Kavurmacioglu, Emir"}, {"creator": "Ethier, Jonathan"}, {"creator": "Basar, Ayse"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05656-2", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "15", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In this paper, we investigate the capability of generative adversarial networks, including conditional and conditional convolutional generative adversarial networks, in generating electromagnetic engineered surfaces (EES). Generative models such as generative adversarial networks and their conditional variants can be used to generate different categories of designs based on the current dataset. k-means clustering algorithm is used to obtain the desirable categories of EES designs, including an initial two main categories, followed by six and eight subcategories. Conditional and conditional convolutional generative adversarial networks are proposed and trained on designs with different image dimensions conditioned on different sets of categories. The trained conditional convolutional generative adversarial network models have comparable accuracy with conditional generative adversarial network in low-dimensional designs over two categories. Conditional convolutional generative adversarial networks generate more unique designs for six and eight categories for smaller image dimensions (e.g., 9 × 9 designs) and for two main categories over larger designs. Both generative adversarial network structures are suitable for generating a wide variety of low- and high-pass EES designs. The creation of new datasets can benefit from conditional convolutional generative adversarial networks to provide greater variety in designs.", "conferenceInfo": [], "keyword": ["Electromagnetic engineered surfaces", "Metasurfaces", "Generative adversarial networks", "mm-Wave spectrum", "Machine learning"]}, {"contentType": "Article", "identifier": "doi:10.1186/s13040-020-00232-9", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s13040-020-00232-9"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s13040-020-00232-9"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s13040-020-00232-9"}], "title": "Identification of the active substances and mechanisms of ginger for the treatment of colon cancer based on network pharmacology and molecular docking", "creators": [{"creator": "Zhang, Meng-Meng"}, {"creator": "Wang, Dan"}, {"creator": "Lu, Feng"}, {"creator": "Zhao, Rong"}, {"creator": "Ye, Xun"}, {"creator": "He, Lin"}, {"creator": "Ai, Li"}, {"creator": "Wu, Chun-Jie"}], "publicationName": "BioData Mining", "openaccess": "true", "doi": "10.1186/s13040-020-00232-9", "publisher": "BioMed Central", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "", "eIssn": "1756-0381", "volume": "14", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "16", "journalId": "13040", "onlineDate": "2021-01-11", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Background and objective Colon cancer is occurring at an increasing rate and ginger ( Zingiber officinale ) , as a commonly used herbal medicine, has been suggested as a potential agent for colon cancer. This study was aimed to identify the bioactive components and potential mechanisms of ginger for colon cancer prevention by an integrated network pharmacology approach. Methods The putative ingredients of ginger and its related targets were discerned from the TCMSP  and Swiss target prediction database. After that, the targets interacting with colon cancer were collected using Genecards, OMIM, and Drugbank databases. KEGG pathway and GO enrichment analysis were performed to explore the signaling pathways related to ginger for colon cancer treatments. The PPI and compound-target-disease networks were constructed using Cytoscape 3.8.1. Finally, Discovery studio software was employed to confirm the key genes and active components from ginger. Results Six potential active compounds, 285 interacting targets in addition to 1356 disease-related targets were collected, of which 118 intersection targets were obtained. A total of 34 key targets including PIK3CA, SRC, and TP53 were identified through PPI network analysis. These targets were mainly focused on the biological processes of phosphatidylinositol 3-kinase signaling, cellular response to oxidative stress, and cellular response to peptide hormone stimulus. The KEGG enrichment manifested that three signaling pathways were closely related to colon cancer prevention of ginger, cancer, endocrine resistance, and hepatitis B pathways. TP53, HSP90AA1, and JAK2 were viewed as the most important genes, which were validated by molecular docking simulation. Conclusion This study demonstrated that ginger produced preventive effects against colon cancer by regulating multi-targets and multi-pathways with multi-components. And, the combined data provide novel insight for ginger compounds developed as new drug for anti-colon cancer.", "conferenceInfo": [], "keyword": ["Ginger", "Colon cancer", "GO enrichment", "KEGG enrichment", "Molecular docking", "1-Monolinolein"]}, {"contentType": "Article", "identifier": "doi:10.1007/s13278-021-00720-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s13278-021-00720-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s13278-021-00720-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s13278-021-00720-8"}], "title": "Centrality informed embedding of networks for temporal feature extraction", "creators": [{"creator": "Oggier, Frédérique"}, {"creator": "Datta, Anwitaman"}], "publicationName": "Social Network Analysis and Mining", "openaccess": "false", "doi": "10.1007/s13278-021-00720-8", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "1869-5450", "eIssn": "1869-5469", "volume": "11", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "14", "journalId": "13278", "onlineDate": "2021-01-11", "coverDate": "2021-12", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag GmbH, AT part of Springer Nature", "abstract": "We propose a two-step methodology for exploring the temporal characteristics of a network. First, we construct a graph time series, where each snapshot is the result of a temporal whole-graph embedding. The embedding is carried out using the degree, Katz and betweenness centralities to characterize first and higher order proximities among vertices. Then a principal component analysis is performed over the collected temporal graph samples, which exhibits eigengraphs, graphs whose temporal weight variations model the sampled graph series. Analysis of the temporal timeline of each of the main eigengraphs reveals moments of importance in terms of structural graph changes. Parameters such as the dimension of the embeddings and the number of temporal samples are explored. Two case studies are presented: a Bitcoin subgraph, where findings are cross-checked by looking at the subgraph behavior itself, and the Enron email network, which allows us to compare our findings with prior studies. In both cases, the proposed methodology successfully identified temporal structural changes in the graph evolution.", "conferenceInfo": [], "keyword": ["Social network dynamics", "Time series of graphs", "Dynamic network", "Centrality", "Graph embedding"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05564-5", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05564-5"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05564-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05564-5"}], "title": "LSTM training set analysis and clustering model development for short-term traffic flow prediction", "creators": [{"creator": "Doğan, Erdem"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05564-5", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "14", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Long short-term memory (LSTM) is becoming increasingly popular in the short-term flow. In order to develop high-quality prediction models, it is worth investigating the LSTM potential deeply for traffic flow prediction. This study has two objectives: first, to observe the effect of using different sized training sets in LSTM training for various and numerous databases; second, to develop a clustering model that contributes to adjusting the training set size. For this purpose, 83 datasets were divided into certain sizes and LSTM model performances were examined depending on these training set sizes. As a result, enlargement of the training set size reduced LSTM errors monotonic for certain datasets. This phenomenon was modeled with the state-of-the-art clustering algorithms, such as K-nearest neighbor, support vector machine (SVM), logistic regression and pattern recognition networks (PRNet). In these models, statistical properties of datasets were utilized as input. The best results were obtained by PRNet, and SVM model performance was closest to PRNet. This study indicates that enlarging the training set size in traffic flow prediction increases the LSTM performance monotonically for specific datasets. In addition, a high-precision clustering model is presented to assist researchers in short-term traffic forecasting to adjust the size of the training set.", "conferenceInfo": [], "keyword": ["Traffic flow", "LSTM", "Training set", "Prediction", "Clustering"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05568-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05568-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05568-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05568-1"}], "title": "Evolutionary synthetic oversampling technique and cocktail ensemble model for warfarin dose prediction with imbalanced data", "creators": [{"creator": "Tao, Yanyun"}, {"creator": "Jiang, Bin"}, {"creator": "Xue, Ling"}, {"creator": "Xie, Cheng"}, {"creator": "Zhang, Yuzhen"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05568-1", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "19", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "To improve the accuracy of warfarin daily dose prediction, we develop an evolutionary synthetic oversampling technique (ESMOTE) with a cocktail ensemble model (CEM) called ESMOTE-CEM. Different from conventional oversampling methods, ESMOTE finds the near-optimal oversampling parameters by evolving the parameter representation based on the pre-predicted warfarin dose and then synthesizes new samples to balance the data. The CEM, which improves the performance of random forest (RF) and boosted regression tree (BRT) models using a hybrid mechanism in the regression calculation, estimates the daily dose of warfarin. We test the ESMOTE-CEM on a dataset of 733 samples collected from the First Affiliated Hospital of Soochow University and the International Warfarin Pharmacogenetics Consortium (IWPC). The results show that ESMOTE outperformed the other oversampling methods by at least 6.98% for R ^2 and 5.03% for the mean squared error ( MSE ). In terms of the percentage of patients whose predicted warfarin dose is within 20% of the actual stable therapeutic dose (20%- p value), the ESMOTE-CEM achieves a 20%- p value of 50%. Moreover, compared to RF, BRT and AdaBoost models, the CEM is the most suitable base predictive model for ESMOTE.", "conferenceInfo": [], "keyword": ["Warfarin dose prediction", "Data imbalance", "Evolutionary SMOTE", "Cocktail ensemble model", "Boost regression tree", "Random forest"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05570-7", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05570-7"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05570-7"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05570-7"}], "title": "A novel ensemble method for classification in imbalanced datasets using split balancing technique based on instance hardness (sBal_IH)", "creators": [{"creator": "Chongomweru, Halimu"}, {"creator": "Kasem, Asem"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05570-7", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "22", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Classification tasks in datasets that suffer from high class imbalance pose challenge to machine learning algorithms and such datasets are prevalent in many real-world domains and applications. In machine learning research, ensemble methods for classification tasks in imbalanced datasets have attracted a lot of attention due to their ability to improve classification performance. However, these methods are still prone to the negative effects of noise in the training sets. Furthermore, many of them alter the original class distribution to create a sort of balance in the datasets through over-sampling or undersampling techniques, which can lead to overfitting or discarding useful data, respectively, and thus may still hamper performance. In this work, we propose a novel ensemble method for classification that creates an arbitrary number of balanced splits (sBal) of data generated based on Instance Hardness as a weighting mechanism for creating balanced bags. Each of the generated bags will contain all the minority instances, and a mixture of majority instances with varying degrees of hardness (easy, normal, and hard), and we call this approach sBal_IH technique. This will enable base learners to train on different balanced bags comprising varied characteristics of the training data. We evaluated the performance of our proposed method on a total of 100 datasets that include 30 synthetic datasets with controlled levels of noise, 29 balanced and 41 imbalanced real-world datasets, and compared its performance with both traditional ensemble methods (Bagging, Wagging Random Forest, and AdaBoost), and those specialized for class imbalanced problems (Balanced Bagging, Balanced Random forest, RUSBoost, and Easy Ensemble). The results reveal that our proposed method brings a substantial improvement in classification performance relevant to the compared methods. For statistical significance analysis, we conducted Friedman’s nonparametric statistical test with Bergman post hoc test. The analysis shows that our method performs significantly better than the compared traditional and specialized ensemble methods for imbalanced problems across many datasets.", "conferenceInfo": [], "keyword": ["Imbalanced data", "Binary classification", "Instance hardness", "Data complexity", "Ensemble", "Split balancing", "Balanced bagging", "Balanced random forest", "Easy ensemble", "Wagging"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05574-3", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05574-3"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05574-3"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05574-3"}], "title": "Special issue on data processing techniques and applications for Cyber-Physical Systems (DPTA 2019)", "creators": [{"creator": "Huang, Chuanchao"}, {"creator": "Chan, Yu-Wei"}, {"creator": "Yen, Neil Y."}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05574-3", "publisher": "Springer", "publicationDate": "2021-01-11", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["EditorialNotes", "Editorial "], "startingPage": "1", "endingPage": "3", "journalId": "521", "onlineDate": "2021-01-11", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "", "conferenceInfo": []}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00400-y", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00400-y"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00400-y"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00400-y"}], "title": "A novel multi-source information-fusion predictive framework based on deep neural networks for accuracy enhancement in stock market prediction", "creators": [{"creator": "Nti, Isaac Kofi"}, {"creator": "Adekoya, Adebayo Felix"}, {"creator": "Weyori, Benjamin Asubam"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00400-y", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "28", "journalId": "40537", "onlineDate": "2021-01-09", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "The stock market is very unstable and volatile due to several factors such as public sentiments, economic factors and more. Several Petabytes volumes of data are generated every second from different sources, which affect the stock market. A fair and efficient fusion of these data sources (factors) into intelligence is expected to offer better prediction accuracy on the stock market. However, integrating these factors from different data sources as one dataset for market analysis is seen as challenging because they come in a different format (numerical or text). In this study, we propose a novel multi-source information-fusion stock price prediction framework based on a hybrid deep neural network architecture (Convolution Neural Networks (CNN) and Long Short-Term Memory (LSTM)) named IKN-ConvLSTM. Precisely, we design a predictive framework to integrate stock-related information from six (6) heterogeneous sources. Secondly, we construct a base model using CNN, and random search algorithm as a feature selector to optimise our initial training parameters. Finally, a stacked LSTM network is fine-tuned by using the tuned parameter (features) from the base-model to enhance prediction accuracy. Our approach's emperical evaluation was carried out with stock data (January 3, 2017, to January 31, 2020) from the Ghana Stock Exchange (GSE). The results show a good prediction accuracy of 98.31%, specificity (0.9975), sensitivity (0.8939%) and F-score (0.9672) of the amalgamated dataset compared with the distinct dataset. Based on the study outcome, it can be concluded that efficient information fusion of different stock price indicators as a single data source for market prediction offer high prediction accuracy than individual data sources.", "conferenceInfo": [], "keyword": ["Deep neural networks", "Convolution neural network", "Long short-term memory", "Information fusion system", "Stock market", "Google trends", "Algorithmic trading"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05668-y", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05668-y"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05668-y"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05668-y"}], "title": "Investigation of PCA as a compression pre-processing tool for X-ray image classification", "creators": [{"creator": "Doorsamy, W."}, {"creator": "Rameshar, V."}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05668-y", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I. : 2019 India Intl. Congress on Computational Intelligence", "genre": ["OriginalPaper", "S.I. : 2019 India Intl. Congress on Computational Intelligence"], "startingPage": "1", "endingPage": "11", "journalId": "521", "onlineDate": "2021-01-09", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Image classification has rapidly gained interest in the medical field with the ability to assist practitioners to diagnose a variety of conditions. Due to the critical nature of the application, any pre-processing function that may compromise the fitness of the classifier requires careful assessment. Image compression, albeit necessary in terms of volume-based goals, is an example of such a preprocessing function that can deeply affect data veracity. In this work, the trade-off between volume and veracity in bone fracture classification using X-ray images is investigated. The impacts of the dimensionality reduction technique—via Principal Component Analysis—as a compression tool on X-ray image classification are explored. The effects of the compression technique on the detection of fractures are assessed by evaluating how reductions in principal components of the X-ray image, and subsequently its volume, affect the accuracy of the fracture classification. Varying levels of compression are applied to both healthy and fracture image sets with tests conducted using ANFIS, SVM and ANN classifiers. Results indicate that a potentially feasible compression range exists whereby classification accuracy is acceptably diminished, after which further compression yields are marginal and classification accuracies drastically decrease. Overall results demonstrate the suitability of the method which yields compression levels of up to 94% with a corresponding minimal drop in classification accuracy of 2%.", "conferenceInfo": [], "keyword": ["Image classification", "X-ray", "Compression", "Volume", "Veracity", "Diagnosis"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05599-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05599-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05599-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05599-8"}], "title": "Enhanced coyote optimizer-based cascaded load frequency controllers in multi-area power systems with renewable", "creators": [{"creator": "Abou El-Ela, Adel A."}, {"creator": "El-Sehiemy, Ragab A."}, {"creator": "Shaheen, Abdullah M."}, {"creator": "Diab, Abd El-Gelil"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05599-8", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "19", "journalId": "521", "onlineDate": "2021-01-09", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Recently, the renewable energy has been occupied a lot of attention around the world since it presents cheap and sustainable energy. Consequently, its presence in power systems becomes a fact that had to deal with. Hence, load frequency control (LFC) in multi-area power systems that constitute photovoltaic (PV) and thermal plant sources is proposed. Two forms of competing cascaded controllers, namely proportional integral–proportional integral (PI–PI) and proportional–derivative with filter-PI (PDn-PI), are investigated, and their performances are compared with traditional PI and PIDn controller. An enhanced coyote optimization algorithm (ECOA) is proposed for finding the optimal tuned parameters of the proposed controllers. Furthermore, the uncertainty is considered under the variation of system parameters by ± 40%. The performance of the proposed competing controllers is tested under dynamic load change that is applied individually in each area. These controllers are applied on two dissimilar test cases with various sets of disturbances. The obtained results are compared with various reported techniques. The simulated comparisons declare the great efficiency with high superiority robustness of the proposed cascaded PDn-PI based on ECOA for handling the LFC in multi-area power systems.", "conferenceInfo": [], "keyword": ["Enhanced coyote optimizer", "Load frequency control", "Multi-area power system", "Photovoltaic panel", "Cascaded controller", "Uncertainty"]}, {"contentType": "Article", "identifier": "doi:10.1007/s13278-020-00719-7", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s13278-020-00719-7"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s13278-020-00719-7"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s13278-020-00719-7"}], "title": "Information diffusion modeling and analysis for socially interacting networks", "creators": [{"creator": "Kumar, Pawan"}, {"creator": "Sinha, Adwitiya"}], "publicationName": "Social Network Analysis and Mining", "openaccess": "false", "doi": "10.1007/s13278-020-00719-7", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "1869-5450", "eIssn": "1869-5469", "volume": "11", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "18", "journalId": "13278", "onlineDate": "2021-01-09", "coverDate": "2021-12", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag GmbH, AT part of Springer Nature", "abstract": "Social network analysis provides innovative techniques to analyze interactions among entities by emphasizing social relationships. Diffusion in the social network can be referred to spread of information among interconnected nodes or entities in a network. The rate and intensity of diffusion depend upon network topology and initialization of network parameters. Individual nodes act as source of motivation for others in the diffusion process. The epidemic model is one of the basic diffusion models that helps in analyzing the transmission of infectious disease from one person to another through social connections. This can be further generalized for other socially connected platforms involving information exchange. In our research, we have proposed a diffusion methodology for tracking the rate with which information spread over underlying social interaction structure, with variation in time and other social parameters. In addition to forward state transitions, recoverable transition is also proposed, which allows a node currently under influence of incoming information, to revert back to previous state of perception. The proposed model also assists in predicting the fraction of population getting diffused over real and large-scale complex network for specific temporal domain.", "conferenceInfo": [], "keyword": ["Social network analysis", "Information diffusion", "Complex networks", "Centrality measure", "Epidemic model", "State transitions"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10115-020-01531-7", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10115-020-01531-7"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10115-020-01531-7"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10115-020-01531-7"}], "title": "Closed form word embedding alignment", "creators": [{"creator": "Dev, Sunipa"}, {"creator": "Hassan, Safia"}, {"creator": "Phillips, Jeff M."}], "publicationName": "Knowledge and Information Systems", "openaccess": "false", "doi": "10.1007/s10115-020-01531-7", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "0219-1377", "eIssn": "0219-3116", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "24", "journalId": "10115", "onlineDate": "2021-01-09", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "We develop a family of techniques to align word embeddings which are derived from different source datasets or created using different mechanisms (e.g., GloVe or word2vec). Our methods are simple and have a closed form to optimally rotate, translate, and scale to minimize root mean squared errors or maximize the average cosine similarity between two embeddings of the same vocabulary into the same dimensional space. Our methods extend approaches known as absolute orientation, which are popular for aligning objects in three dimensions, and generalize an approach by Smith et al. (ICLR 2017). We prove new results for optimal scaling and for maximizing cosine similarity. Then, we demonstrate how to evaluate the similarity of embeddings from different sources or mechanisms, and that certain properties like synonyms and analogies are preserved across the embeddings and can be enhanced by simply aligning and averaging ensembles of embeddings.", "conferenceInfo": [], "keyword": ["Word embeddings", "GloVe", "Word2Vec", "ELMo"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05666-0", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05666-0"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05666-0"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05666-0"}], "title": "Selection of optimal wavelet features for epileptic EEG signal classification with LSTM", "creators": [{"creator": "Aliyu, Ibrahim"}, {"creator": "Lim, Chang Gyoon"}], "publicationName": "Neural Computing and Applications", "openaccess": "true", "doi": "10.1007/s00521-020-05666-0", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I. : 2019 India Intl. Congress on Computational Intelligence", "genre": ["OriginalPaper", "S.I. : 2019 India Intl. Congress on Computational Intelligence"], "startingPage": "1", "endingPage": "21", "journalId": "521", "onlineDate": "2021-01-09", "copyright": "©2021 The Author(s)", "abstract": "Epilepsy remains one of the most common chronic neurological disorders; hence, there is a need to further investigate various models for automatic detection of seizure activity. An effective detection model can be achieved by minimizing the complexity of the model in terms of trainable parameters while still maintaining high accuracy. One way to achieve this is to select the minimum possible number of features. In this paper, we propose a long short-term memory (LSTM) network for the classification of epileptic EEG signals. Discrete wavelet transform (DWT) is employed to remove noise and extract 20 eigenvalue features. The optimal features were then identified using correlation and P value analysis. The proposed method significantly reduces the number of trainable LSTM parameters required to attain high accuracy. Finally, our model outperforms other proposed frameworks, including popular classifiers such as logistic regression (LR), support vector machine (SVM), K-nearest neighbor (K-NN) and decision tree (DT).", "conferenceInfo": [], "keyword": ["Classification", "EEG", "Epilepsy", "LSTM", "\n                     -Value", "Wavelet transform"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05672-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05672-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05672-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05672-2"}], "title": "Deep neural network architectures for dysarthric speech analysis and recognition", "creators": [{"creator": "Zaidi, Brahim Fares"}, {"creator": "Selouani, Sid Ahmed"}, {"creator": "Boudraa, Malika"}, {"creator": "Sidi Yakoub, Mohammed"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05672-2", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "20", "journalId": "521", "onlineDate": "2021-01-09", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "This paper investigates the ability of deep neural networks (DNNs) to improve the automatic recognition of dysarthric speech through the use of convolutional neural networks (CNNs) and long short-term memory (LSTM) neural networks. Dysarthria is one of the most common speech communication disorders associated with neurological impairments that can drastically reduce the intelligibility of speech. The aim of the present study is twofold. First, it compares three different input features for training and testing dysarthric speech recognition systems. These features are the mel-frequency cepstral coefficients (MFCCs), mel-frequency spectral coefficients (MFSCs), and the perceptual linear prediction features (PLPs). Second, the performance of the CNN- and LSTM-based architectures is compared against a state-of-the-art baseline system based on hidden Markov models (HMMs) and Gaussian mixture models (GMMs) to determine the best dysarthric speech recognizer. Experimental results show that the CNN-based system using perceptual linear prediction features provides a recognition rate that can reach 82%, which constitutes relative improvement of 11% and 32% when compared to the performance of LSTM- and GMM-HMM-based systems, respectively.", "conferenceInfo": [], "keyword": ["Deep neural network", "Convolutional neural network", "Long short-term memory", "Mel-frequency cepstral coefficient", "Mel-frequency spectral coefficient", "Perceptual linear prediction", "Hidden Markov model", "Gaussian mixture models"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05676-y", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05676-y"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05676-y"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05676-y"}], "title": "FER-net: facial expression recognition using deep neural net", "creators": [{"creator": "Mohan, Karnati"}, {"creator": "Seal, Ayan"}, {"creator": "Krejcar, Ondrej"}, {"creator": "Yazidi, Anis"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05676-y", "publisher": "Springer", "publicationDate": "2021-01-09", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "12", "journalId": "521", "onlineDate": "2021-01-09", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Automatic facial expression recognition (FER) is one of the most challenging tasks in computer vision. FER admits a wide range of applications in human–computer interaction, behavioral psychology, and human expression synthesis. Extensive works have been reported in this field, mainly, based on handcrafted features. However, it is a challenging task to accurately extract all the correlated handcrafted features due to the effect of variations caused by emotional state. Therefore, there is a quest for further research on accurately extracting relevant features that can capture changes in facial expressions (FEs) with high fidelity. In this study, we propose FER-net: a convolution neural network to distinguish FEs efficiently with the help of the softmax classifier. We implement our method FER-net along with twenty-one state-of-the-art methods and test them on five benchmarking datasets, namely FER2013, Japanese Female Facial Expressions, Extended CohnKanade, Karolinska Directed Emotional Faces, and Real-world Affective Faces. Seven FEs, namely neutral, anger, disgust, fear, happiness, sadness, and surprise, are considered in this work. The average accuracies on these datasets are 78.9%, 96.7%, 97.8%, 82.5% and 81.68%, respectively. The obtained results demonstrate that FER-net is preeminent in comparison with twenty-one state-of-the-art methods.", "conferenceInfo": [], "keyword": ["Facial expression recognition", "Convolution neural network", "Softmax classifier"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05667-z", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05667-z"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05667-z"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05667-z"}], "title": "HeteGraph: graph learning in recommender systems via graph convolutional networks", "creators": [{"creator": "Tran, Dai Hoang"}, {"creator": "Sheng, Quan Z."}, {"creator": "Zhang, Wei Emma"}, {"creator": "Aljubairy, Abdulwahab"}, {"creator": "Zaib, Munazza"}, {"creator": "Hamad, Salma Abdalla"}, {"creator": "Tran, Nguyen H."}, {"creator": "Khoa, Nguyen Lu Dang"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05667-z", "publisher": "Springer", "publicationDate": "2021-01-08", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I. : Deep Social Computing", "genre": ["OriginalPaper", "S.I. : Deep Social Computing"], "startingPage": "1", "endingPage": "17", "journalId": "521", "onlineDate": "2021-01-08", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "With the explosive growth of online information, many recommendation methods have been proposed. This research direction is boosted with deep learning architectures, especially the recently proposed graph convolutional networks (GCNs). GCNs have shown tremendous potential in graph embedding learning thanks to its inductive inference property. However, most of the existing GCN-based methods focus on solving tasks in the homogeneous graph settings, and none of them considers heterogeneous graph settings. In this paper, we bridge the gap by developing a novel framework called HeteGraph based on the GCN principles. HeteGraph can handle heterogeneous graphs in the recommender systems. Specifically, we propose a sampling technique and a graph convolutional operation to learn high-quality graph’s node embeddings, which differs from the traditional GCN approaches where a full graph adjacency matrix is needed for the embedding learning. We design two models based on the HeteGraph framework to evaluate two important recommendation tasks, namely item rating prediction and diversified item recommendations . Extensive experiments show the encouraging performance of HeteGraph on the first task and the state-of-the-art performance on the second task.", "conferenceInfo": [], "keyword": ["Recommender systems", "Graph convolutional network", "Heterogeneous graphs", "Neural networks"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05636-6", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05636-6"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05636-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05636-6"}], "title": "COVIDScreen: explainable deep learning framework for differential diagnosis of COVID-19 using chest X-rays", "creators": [{"creator": "Singh, Rajeev Kumar"}, {"creator": "Pandey, Rohan"}, {"creator": "Babu, Rishie Nandhan"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05636-6", "publisher": "Springer", "publicationDate": "2021-01-08", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "22", "journalId": "521", "onlineDate": "2021-01-08", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "COVID-19 has emerged as a global crisis with unprecedented socio-economic challenges, jeopardizing our lives and livelihoods for years to come. The unavailability of vaccines for COVID-19 has rendered rapid testing of the population instrumental in order to contain the exponential rise in cases of infection. Shortage of RT-PCR test kits and delays in obtaining test results calls for alternative methods of rapid and reliable diagnosis. In this article, we propose a novel deep learning-based solution using chest X-rays which can help in rapid triaging of COVID-19 patients. The proposed solution uses image enhancement, image segmentation, and employs a modified stacked ensemble model consisting of four CNN base-learners along with Naive Bayes as meta-learner to classify chest X-rays into three classes viz. COVID-19, pneumonia, and normal. An effective pruning strategy as introduced in the proposed framework results in increased model performance, generalizability, and decreased model complexity. We incorporate explainability in our article by using Grad-CAM visualization in order to establish trust in the medical AI system. Furthermore, we evaluate multiple state-of-the-art GAN architectures and their ability to generate realistic synthetic samples of COVID-19 chest X-rays to deal with limited numbers of training samples. The proposed solution significantly outperforms existing methods, with 98.67% accuracy, 0.98 Kappa score, and F-1 scores of 100, 98, and 98 for COVID-19, normal, and pneumonia classes, respectively, on standard datasets. The proposed solution can be used as one element of patient evaluation along with gold-standard clinical and laboratory testing.", "conferenceInfo": [], "keyword": ["COVID-19", "Chest X-rays", "Deep learning", "Ensemble learning", "ExplainableAI", "GANs"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05603-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05603-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05603-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05603-1"}], "title": "EEG extended source imaging with structured sparsity and \n            \n              \n            \n            $$L_1$$\n            \n              \n                L\n                1\n              \n            \n          -norm residual", "creators": [{"creator": "Xu, Furong"}, {"creator": "Liu, Ke"}, {"creator": "Yu, Zhuliang"}, {"creator": "Deng, Xin"}, {"creator": "Wang, Guoyin"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05603-1", "publisher": "Springer", "publicationDate": "2021-01-08", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "12", "journalId": "521", "onlineDate": "2021-01-08", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "It is a long-standing challenge to reconstruct the locations and extents of cortical neural activities from electroencephalogram (EEG) recordings, especially when the EEG signals contain strong background activities and outlier artifacts. In this work, we propose a robust source imaging method called $$L_1$$ L 1 R-SSSI. To alleviate the effect of outliers in EEG, $$L_1$$ L 1 R-SSSI employs the $$L_1$$ L 1 -loss to model the residual error. To obtain locally smooth and globally sparse estimations, $$L_1$$ L 1 R-SSSI adopts the structured sparsity constraint, which incorporates the $$L_1$$ L 1 -norm regularization in both the variation and original source domain. The estimations of $$L_1$$ L 1 R-SSSI are efficiently obtained using the alternating direction method of multipliers (ADMM) algorithm. Results of simulated and experimental data analysis demonstrate that $$L_1$$ L 1 R-SSSI effectively suppresses the effect of the outlier artifacts in EEG. $$L_1$$ L 1 R-SSSI outperforms the traditional $$L_2$$ L 2 -norm-based methods (e.g., wMNE, LORETA), and SISSY, which employs $$L_2$$ L 2 -norm loss and structured sparsity, indicated by the larger AUC (average AUC $$>0.80$$ > 0.80 ), smaller SD (average SD $$<50$$ < 50 mm), DLE (average DLE $$<10$$ < 10 mm) and RMSE (average RMSE $$<1.75$$ < 1.75 ) values under all the numerically simulated conditions. $$L_1$$ L 1 R-SSSI also provides better estimations of extended sources than the method with $$L_1$$ L 1 -loss and $$L_p$$ L p -norm regularization term (e.g., LAPPS).", "conferenceInfo": [], "keyword": ["EEG source imaging", "Outliers", "Structured sparsity", "ADMM"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05538-7", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05538-7"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05538-7"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05538-7"}], "title": "Memristor-based BAM circuit implementation for image associative memory and filling-in", "creators": [{"creator": "Yang, Zijia"}, {"creator": "Wang, Xiaoping"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05538-7", "publisher": "Springer", "publicationDate": "2021-01-08", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "14", "journalId": "521", "onlineDate": "2021-01-08", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "Associative memory and filling-in are two essential functions of the human brain. To implement these two brain-inspired functions in hardware, we proposed a memristor-based bidirectional associative memory (BAM) circuit in this paper. This circuit combines an online algorithm with a memristor array adjustment process, thus makes the circuit more universal for various tasks. The proposed circuit is constructed out of memristive synaptic circuits, IN modules and ACT modules. The memristive synaptic circuits utilize memristor arrays to represent weight matrix and operate corresponding operations hence make computing-in-memory and process information in parallel, which simplifies the complexity of circuit and improves the processing speed. The IN modules employ transistors as switches to choose the input layer hence can get initial information flow bidirectionally. The ACT modules perform activation function and can output continuous arbitrary real numbers. Thereby, both binary and gray-scale images can be tested in the proposed circuit. In addition to the hetero-association and filling-in results given in detail, the retrieval rates of the proposed circuit with the impact of different degrees of noise and the number of stored patterns are also evaluated and compared with software-based BAM. The simulation has experimented via MATLAB and PSpice, and the corresponding results show a remarkable performance of the proposed circuit. The influence of memristor’s stuck-at-fault is also considered. In comparison with software-based BAM and similar memristor-based neural network circuit, the proposed circuit performs better in processing speed.", "conferenceInfo": [], "keyword": ["Memristors", "Bidirectional associative memory", "Associative memory", "Filling-in"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05663-3", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05663-3"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05663-3"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05663-3"}], "title": "Evaluate, explain, and explore the state more exactly: an improved Actor-Critic algorithm for complex environment", "creators": [{"creator": "Zha, ZhongYi"}, {"creator": "Wang, Bo"}, {"creator": "Tang, XueSong"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05663-3", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on New Trends of Neural Computing for Advanced Applications", "genre": ["OriginalPaper", "S.I.: New Trends of Neural Computing for Advanced Applications"], "startingPage": "1", "endingPage": "12", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "This paper proposes an Advanced Actor-Critic algorithm, which is improved based on the conventional Actor-Critic algorithm, to train the agent to play the complex strategy game StarCraft II. A series of advanced features have been incorporated, including the distributional advantage estimation, information entropy-based uncertainty estimation, self-confidence-based exploration, and normal constraint-based update strategy. A case study including seven StarCraft II mini-games is investigated to identify the effectiveness of the proposed approach, where the famous A3C algorithm is adopted as the comparative baseline. The results verify the superiority of the improved algorithm in accuracy and training efficacy, in complex environment with high-dimensional and hybrid state and action space.", "conferenceInfo": [], "keyword": ["Deep reinforcement learning", "Video game AI", "Advanced actor-critic", "Distributional advantage estimation", "Normal constraint"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05598-9", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05598-9"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05598-9"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05598-9"}], "title": "An improved generative adversarial network for translating clothes from the human body to tiled image", "creators": [{"creator": "Zhang, Xiaoli"}, {"creator": "Sun, Yanfang"}, {"creator": "Liu, Linlin"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05598-9", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "13", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Nowadays, purchasing the products similar to the styles of stars’ products has become a new trend in e-commerce platforms. Clothing transaction constitutes to the major part of these kinds of online purchasing. Traditional methods firstly segment clothes from human body and then input the segmented clothing image patch into a retrieval system as a query in a way that similar clothing items could be retrieved. However, the segmented clothing images usually contain complex backgrounds, and these clothing items appear to be twisted, as they are segmented from human body straightforwardly. In order to assist this cross-scenario clothing retrieval, this paper introduces a new triple-supervised GAN (TripleGAN) model by translating the clothes on human body into tiled clothes. Our model was trained on a large-scale dataset including over 30,000 clothing pairs constructed by ourselves. Extensive experimental results exhibit that our model consistently can generate tiled clothing images with more delicate details and higher quality compared with other models. Our model also shows promising performance in terms of cross-domain clothing retrieval in real-life applications.", "conferenceInfo": [], "keyword": ["Generative adversarial network (GAN)", "Clothing retrieval", "Image segmentation", "Cross-scenario"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05634-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05634-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05634-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05634-8"}], "title": "A secure and robust color image watermarking using nature-inspired intelligence", "creators": [{"creator": "Sharma, Sourabh"}, {"creator": "Sharma, Harish"}, {"creator": "Sharma, Janki Ballabh"}, {"creator": "Poonia, Ramesh Chandra"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05634-8", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on Machine Learning for Security and Privacy: Advancing the state-of-the-art applications", "genre": ["OriginalPaper", "S.I. : Machine Learning Applications for Security"], "startingPage": "1", "endingPage": "19", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "The security of multimedia information is a prime concern in the present digital world. As a remedy, a robust color image watermarking in the transform domain using artificial intelligence is reported in this article. A color host image is secured by embedding a color watermark by utilizing the singular value decomposition and discrete wavelet transform. The color watermark information is scrambled with a chaotic map to give an additional stage of protection to overcome the problem of illegal copying and alteration of digital data by unauthorized users. All three RGB color channels of host singular values are modified with principal components of respective RGB information of scrambled watermark image. Ownership of data is provided by extracting the watermark in the presence of a secret key used while embedding process. To overcome the trade-off between the imperceptibility and robustness of the proposed algorithm artificial bee colony is used to optimize the scaling factor. The implementation of the proposed algorithm is performed on the MATLAB tool to compute the performance against the intentional and non-intentional image processing attacks. Comparative analysis with other related watermarking algorithms proves the robust, secure, and invisible nature of the proposed watermarking scheme.", "conferenceInfo": [], "keyword": ["Digital image watermarking", "Chaotic map", "Security", "Artificial bee colony optimization", "Robustness", "Imperceptibility"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10791-020-09388-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10791-020-09388-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10791-020-09388-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10791-020-09388-8"}], "title": "LSH kNN graph for diffusion on image retrieval", "creators": [{"creator": "Magliani, Federico"}, {"creator": "Prati, Andrea"}], "publicationName": "Information Retrieval Journal", "openaccess": "false", "doi": "10.1007/s10791-020-09388-8", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "1386-4564", "eIssn": "1573-7659", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": "OriginalPaper", "startingPage": "1", "endingPage": "23", "journalId": "10791", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer Nature B.V. part of Springer Nature", "abstract": "Experimental results demonstrated the goodness of the diffusion mechanism for several computer vision tasks: image retrieval, semi-supervised and supervised learning, image classification. Diffusion requires the construction of a kNN graph in order to work. As predictable, the quality of the created graph influences the final results. Unfortunately, the larger the used dataset is, the more time the construction of the kNN graph takes, since the number of edges between nodes grows exponentially. A common and effective solution to deal with this problem is the brute-force method, but it requires a very long computation on large datasets. This paper proposes improvements on LSH kNN graph method that efficiently create an approximate kNN graph which is demonstrated to be faster than other state-of-the-art methods (18x faster than brute force on a dataset of more than 100k images) for content-based image retrieval, while obtaining also comparable performance in terms of accuracy. LSH kNN graph has been tested and compared with the state-of-the-art approaches for image retrieval on several public datasets, such as Oxford5k, $${\\mathcal {R}}$$ R Oxford5k, Paris6k, $${\\mathcal {R}}$$ R Paris6k and Oxford105k.", "conferenceInfo": [], "keyword": ["Content-based image retrieval", "Diffusion", "kNN graph"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05654-4", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05654-4"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05654-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05654-4"}], "title": "Learning knowledge graph embedding with a bi-directional relation encoding network and a convolutional autoencoder decoding network", "creators": [{"creator": "Hu, Kairong"}, {"creator": "Liu, Hai"}, {"creator": "Zhan, Choujun"}, {"creator": "Tang, Yong"}, {"creator": "Hao, Tianyong"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05654-4", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "17", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Derived from knowledge bases, knowledge graphs represent knowledge expressions in graphs, which utilize nodes and edges to denote entities and relations conceptually. Knowledge graph can be described in textual triple form, consisting of head entities, tail entities and relations between entities. In order to represent elements in knowledge graphs, knowledge graph embedding techniques are proposed to map entities and relations into continuous vector spaces as numeric vectors for computational efficiency. Convolution-based knowledge graph embedding models have promising performance for knowledge graph representation learning. However, the input of those neural network-based models is frequently in handmade forms and may suffer from low efficiency in feature extraction procedure of the models. In this paper, a convolutional autoencoder is proposed for knowledge graph representation learning with entity pairs as input, aiming to obtain corresponding hidden relation representation. In addition, a bi-directional relation encoding network is utilized to represent semantic of entities in different directional relation patterns, as an encoder to output representation for initialization of the convolutional autoencoder. Experiments are conducted on standard datasets including, WN18RR, Kinship, NELL-995 and FB15k-237 as a link prediction task. Besides, input embedding matrix composed of different ingredients is designed to evaluate performances of the convolutional autoencoder. The results demonstrate that our model is effective in learning representation from entity feature interactions.", "conferenceInfo": [], "keyword": ["Bi-directional relation", "Convolutional autoencoder", "Knowledge graph", "Link prediction"]}, {"contentType": "Article", "identifier": "doi:10.1007/s13735-020-00202-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s13735-020-00202-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s13735-020-00202-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s13735-020-00202-1"}], "title": "An automatic approach of audio feature engineering for the extraction, analysis and selection of descriptors", "creators": [{"creator": "Jiménez, Marvin"}, {"creator": "Aguilar, Jose"}, {"creator": "Monsalve-Pulido, Julin"}, {"creator": "Montoya, Edwin"}], "publicationName": "International Journal of Multimedia Information Retrieval", "openaccess": "false", "doi": "10.1007/s13735-020-00202-1", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "2192-6611", "eIssn": "2192-662X", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "10", "journalId": "13735", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Currently, it is critical to find the correct features from the audio, in order to analyze the information contained in it. This paper analyzes several feature types in audio from different points of view: time series, sound engineering, etc. In particular, the description of audio as a set of time series is not very common in the literature, and it is one of the aspects studied in this paper. Particularly, this paper proposes an automated method for feature engineering in audios, to extract, analyze and select the best features in a given context. Specifically, this paper develops a hybrid scheme of extraction of audio descriptors based on different principles and defines an automatic approach for the analysis and selection of these descriptors in a given audio context. Finally, our approach was tested on grouping tasks and compared to previous works on audio classification problems, with encouraging results.", "conferenceInfo": [], "keyword": ["Audio feature engineering", "Data mining", "Feature extraction", "Feature selection"]}, {"contentType": "Article", "identifier": "doi:10.1007/s41666-020-00084-2", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s41666-020-00084-2"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s41666-020-00084-2"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s41666-020-00084-2"}], "title": "Pandemic Equation for Describing and Predicting COVID19 Evolution", "creators": [{"creator": "Shur, Michael"}], "publicationName": "Journal of Healthcare Informatics Research", "openaccess": "false", "doi": "10.1007/s41666-020-00084-2", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "2509-4971", "eIssn": "2509-498X", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Collection on COVID-19", "genre": ["OriginalPaper", "Research Article"], "startingPage": "1", "endingPage": "13", "journalId": "41666", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer Nature Switzerland AG part of Springer Nature", "abstract": "The purpose of this work is to describe the dynamics of the COVID-19 pandemics accounting for the mitigation measures, for the introduction or removal of the quarantine, and for the effect of vaccination when and if introduced. The methods used include the derivation of the Pandemic Equation describing the mitigation measures via the evolution of the growth time constant in the Pandemic Equation resulting in an asymmetric pandemic curve with a steeper rise than a decrease and mitigation measures. The Pandemic Equation predicts how the quarantine removal and business opening lead to a spike in the pandemic curve. The effective vaccination reduces the new daily infections predicted by the Pandemic Equation. The pandemic curves in many localities have similar time dependencies but shifted in time. The Pandemic Equation parameters extracted from the well advanced pandemic curves can be used for predicting the pandemic evolution in the localities, where the pandemics is still in the initial stages. Using the multiple pandemic locations for the parameter extraction allows for the uncertainty quantification in predicting the pandemic evolution using the introduced Pandemic Equation. Compared with other pandemic models our approach allows for easier parameter extraction amenable to using Artificial Intelligence models.", "conferenceInfo": [], "keyword": ["COVID19", "Pandemic", "Mitigation", "Quarantine"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05678-w", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05678-w"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05678-w"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05678-w"}], "title": "Deep learning-based ambient assisted living for self-management of cardiovascular conditions", "creators": [{"creator": "Qureshi, Maria Ahmed"}, {"creator": "Qureshi, Kashif Naseer"}, {"creator": "Jeon, Gwanggil"}, {"creator": "Piccialli, Francesco"}], "publicationName": "Neural Computing and Applications", "openaccess": "true", "doi": "10.1007/s00521-020-05678-w", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on Effective and Efficient Deep Learning Based Solutions", "genre": ["OriginalPaper", "S. I.: Effective and Efficient Deep Learning"], "startingPage": "1", "endingPage": "19", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s)", "abstract": "According to the World Health Organization, cardiovascular diseases contribute to 17.7 million deaths per year and are rising with a growing ageing population. In order to handle these challenges, the evolved countries are now evolving workable solutions based on new communication technologies such as ambient assisted living. In these solutions, the most well-known solutions are wearable devices for patient monitoring, telemedicine and mHealth systems. This systematic literature review presents the detailed literature on ambient assisted living solutions and helps to understand how ambient assisted living helps and motivates patients with cardiovascular diseases for self-management to reduce associated morbidity and mortalities. Preferred reporting items for systematic reviews and meta-analyses technique are used to answer the research questions. The paper is divided into four main themes, including self-monitoring wearable systems, ambient assisted living in aged populations, clinician management systems and deep learning-based systems for cardiovascular diagnosis. For each theme, a detailed investigation shows (1) how these new technologies are nowadays integrated into diagnostic systems and (2) how new technologies like IoT sensors, cloud models, machine and deep learning strategies can be used to improve the medical services. This study helps to identify the strengths and weaknesses of novel ambient assisted living environments for medical applications. Besides, this review assists in reducing the dependence on caregivers and the healthcare systems.", "conferenceInfo": [], "keyword": ["Deep learning", "Artificial intelligence", "Cardiovascular", "Healthcare systems", "Sensors", "Wearable technologies"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00385-8", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00385-8"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00385-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00385-8"}], "title": "Stable bagging feature selection on medical data", "creators": [{"creator": "Alelyani, Salem"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00385-8", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "18", "journalId": "40537", "onlineDate": "2021-01-07", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "In the medical field, distinguishing genes that are relevant to a specific disease, let’s say colon cancer, is crucial to finding a cure and understanding its causes and subsequent complications. Usually, medical datasets are comprised of immensely complex dimensions with considerably small sample size. Thus, for domain experts, such as biologists, the task of identifying these genes have become a very challenging one, to say the least. Feature selection is a technique that aims to select these genes, or features in machine learning field with respect to the disease. However, learning from a medical dataset to identify relevant features suffers from the curse-of-dimensionality . Due to a large number of features with a small sample size, the selection usually returns a different subset each time a new sample is introduced into the dataset. This selection instability is intrinsically related to data variance. We assume that reducing data variance improves selection stability. In this paper, we propose an ensemble approach based on the bagging technique to improve feature selection stability in medical datasets via data variance reduction. We conducted an experiment using four microarray datasets each of which suffers from high dimensionality and relatively small sample size. On each dataset, we applied five well-known feature selection algorithms to select varying number of features. The proposed technique shows a significant improvement in selection stability while at least maintaining the classification accuracy. The stability improvement ranges from 20 to 50 percent in all cases. This implies that the likelihood of selecting the same features increased 20 to 50 percent more. This is accompanied with the increase of classification accuracy in most cases, which signifies the stated results of stability.", "conferenceInfo": [], "keyword": ["Feature selection", "Ensemble technique", "Bagging", "Dimensionality reduction", "Medical data", "Microarray", "Variance", "Bias"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00401-x", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00401-x"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00401-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00401-x"}], "title": "Multiclass emotion prediction using heart rate and virtual reality stimuli", "creators": [{"creator": "Bulagang, Aaron Frederick"}, {"creator": "Mountstephens, James"}, {"creator": "Teo, Jason"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00401-x", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Short Report"], "startingPage": "1", "endingPage": "12", "journalId": "40537", "onlineDate": "2021-01-07", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Background Emotion prediction is a method that recognizes the human emotion derived from the subject’s psychological data. The problem in question is the limited use of heart rate (HR) as the prediction feature through the use of common classifiers such as Support Vector Machine (SVM), K-Nearest Neighbor (KNN) and Random Forest (RF) in emotion prediction. This paper aims to investigate whether HR signals can be utilized to classify four-class emotions using the emotion model from Russell’s in a virtual reality (VR) environment using machine learning. Method An experiment was conducted using the Empatica E4 wristband to acquire the participant’s HR, a VR headset as the display device for participants to view the 360° emotional videos, and the Empatica E4 real-time application was used during the experiment to extract and process the participant's recorded heart rate. Findings For intra-subject classification, all three classifiers SVM, KNN, and RF achieved 100% as the highest accuracy while inter-subject classification achieved 46.7% for SVM, 42.9% for KNN and 43.3% for RF. Conclusion The results demonstrate the potential of SVM, KNN and RF classifiers to classify HR as a feature to be used in emotion prediction in four distinct emotion classes in a virtual reality environment. The potential applications include interactive gaming, affective entertainment, and VR health rehabilitation.", "conferenceInfo": [], "keyword": ["Four-class emotion classification", "Electrocardiography", "Machine learning", "Virtual reality", "HR", "Empatica E4", "KNN", "RF", "SVM"]}, {"contentType": "Article", "identifier": "doi:10.1007/s41666-020-00089-x", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s41666-020-00089-x"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s41666-020-00089-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s41666-020-00089-x"}], "title": "COVID-19 Symptom Monitoring and Social Distancing in a University Population", "creators": [{"creator": "Wojtusiak, Janusz"}, {"creator": "Bagchi, Pramita"}, {"creator": "Durbha, Sri Surya Krishna Rama Taraka Naren"}, {"creator": "Mobahi, Hedyeh"}, {"creator": "Mogharab Nia, Reyhaneh"}, {"creator": "Roess, Amira"}], "publicationName": "Journal of Healthcare Informatics Research", "openaccess": "false", "doi": "10.1007/s41666-020-00089-x", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "2509-4971", "eIssn": "2509-498X", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Collection on COVID-19", "genre": ["OriginalPaper", "Research Article"], "startingPage": "1", "endingPage": "18", "journalId": "41666", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer Nature Switzerland AG part of Springer Nature", "abstract": "This paper reports on our efforts to collect daily COVID-19-related symptoms for a large public university population, as well as study relationship between reported symptoms and individual movements. We developed a set of tools to collect and integrate individual-level data. COVID-19-related symptoms are collected using a self-reporting tool initially implemented in Qualtrics survey system and consequently moved to .NET framework. Individual movement data are collected using off-the-shelf tracking apps available for iPhone and Android phones. Data integration and analysis are done in PostgreSQL, Python, and R. As of September 2020, we collected about 184,000 daily symptom responses for 20,000 individuals, as well as over 15,000 days of GPS movement data for 175 individuals. The analysis of the data indicates that headache is the most frequently reported symptom, present almost always when any other symptoms are reported as indicated by derived association rules. It is followed by cough, sore throat, and aches. The study participants traveled on average 223.61 km every week with a large standard deviation of 254.53 and visited on average 5.77 ± 4.75 locations each week for at least 10 min. However, there is no evidence that reported symptoms or prior COVID-19 contact affects movements ( p  > 0.3 in most models). The evidence suggests that although some individuals limit their movements during pandemics, the overall study population do not change their movements as suggested by guidelines.", "conferenceInfo": [], "keyword": ["COVID-19", "Symptom reporting", "GPS movement", "Social distancing", "Unsupervised learning", "Association mining", "Statistical analysis"]}, {"contentType": "Article", "identifier": "doi:10.1007/s13748-020-00223-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s13748-020-00223-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s13748-020-00223-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s13748-020-00223-1"}], "title": "Inference and reasoning in a Bayesian knowledge-intensive CBR system", "creators": [{"creator": "Nikpour, Hoda"}, {"creator": "Aamodt, Agnar"}], "publicationName": "Progress in Artificial Intelligence", "openaccess": "true", "doi": "10.1007/s13748-020-00223-1", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "2192-6352", "eIssn": "2192-6360", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "15", "journalId": "13748", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s)", "abstract": "This paper presents the inference and reasoning methods in a Bayesian supported knowledge-intensive case-based reasoning (CBR) system called BNCreek. The inference and reasoning process in this system is a combination of three methods. The semantic network inference methods and the CBR method are employed to handle the difficulties of inferencing and reasoning in uncertain domains. The Bayesian network inference methods are employed to make the process more accurate. An experiment from oil well drilling as a complex and uncertain application domain is conducted. The system is evaluated against expert estimations and compared with seven other corresponding systems. The normalized discounted cumulative gain (NDCG) as a rank-based metric, the weighted error (WE), and root-square error (RSE) as the statistical metrics are employed to evaluate different aspects of the system capabilities. The results show the efficiency of the developed inference and reasoning methods.", "conferenceInfo": [], "keyword": ["Bayesian network", "Case-based reasoning", "Knowledge-intensive system", "Uncertain domains"]}, {"contentType": "Article", "identifier": "doi:10.1007/s10618-020-00729-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s10618-020-00729-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s10618-020-00729-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s10618-020-00729-1"}], "title": "Social explorative attention based recommendation for content distribution platforms", "creators": [{"creator": "Xiao, Wenyi"}, {"creator": "Zhao, Huan"}, {"creator": "Pan, Haojie"}, {"creator": "Song, Yangqiu"}, {"creator": "Zheng, Vincent W."}, {"creator": "Yang, Qiang"}], "publicationName": "Data Mining and Knowledge Discovery", "openaccess": "false", "doi": "10.1007/s10618-020-00729-1", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "1384-5810", "eIssn": "1573-756X", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": "OriginalPaper", "startingPage": "1", "endingPage": "35", "journalId": "10618", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer Science+Business Media LLC, part of Springer Nature", "abstract": "In modern social media platforms, an effective content recommendation should benefit both creators to bring genuine benefits to them and consumers to help them get really interesting content. To address the limitations of existing methods for social recommendation, we propose Social Explorative Attention Network (SEAN), a social recommendation framework that uses a personalized content recommendation model to encourage personal interests driven recommendation. SEAN has two versions: (1) SEAN-END2END allows user’s attention vector to attend their personalized interested points in the documents. (2) SEAN-KEYWORD extracts keywords from users’ historical readings to capture their long-term interests. It is much faster than the first version, more suitable for practical usage, while SEAN-END2END is more effective. Both versions allow the personalization factors to attend to users’ higher-order friends on the social network to improve the accuracy and diversity of recommendation results. Constructing two datasets in two languages, English and Spanish, from a popular decentralized content distribution platform, Steemit, we compare SEAN models with state-of-the-art collaborative filtering (CF) and content based recommendation approaches. Experimental results demonstrate the effectiveness of SEAN in terms of both Gini coefficients for recommendation equality and F1 scores for recommendation accuracy.", "conferenceInfo": [], "keyword": ["Content recommendation", "Social recommendation", "Social attention networks", "Monte Carlo tree search"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00408-4", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00408-4"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00408-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00408-4"}], "title": "A GPU based multidimensional amplitude analysis to search for tetraquark candidates", "creators": [{"creator": "Sur, Nairit"}, {"creator": "Cristella, Leonardo"}, {"creator": "Florio, Adriano"}, {"creator": "Mastrapasqua, Vincenzo"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00408-4", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Methodology"], "startingPage": "1", "endingPage": "19", "journalId": "40537", "onlineDate": "2021-01-07", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "The demand for computational resources is steadily increasing in experimental high energy physics as the current collider experiments continue to accumulate huge amounts of data and physicists indulge in more complex and ambitious analysis strategies. This is especially true in the fields of hadron spectroscopy and flavour physics where the analyses often depend on complex multidimensional unbinned maximum-likelihood fits, with several dozens of free parameters, with an aim to study the internal structure of hadrons. Graphics processing units (GPUs) represent one of the most sophisticated and versatile parallel computing architectures that are becoming popular toolkits for high energy physicists to meet their computational demands. GooFit is an upcoming open-source tool interfacing ROOT/RooFit to the CUDA platform on NVIDIA GPUs that acts as a bridge between the MINUIT minimization algorithm and a parallel processor, allowing probability density functions to be estimated on multiple cores simultaneously. In this article, a full-fledged amplitude analysis framework developed using GooFit is tested for its speed and reliability. The four-dimensional fitter framework, one of the firsts of its kind to be built on GooFit, is geared towards the search for exotic tetraquark states in the $$B^0 \\rightarrow J/\\psi K \\pi$$ B 0 → J / ψ K π decays and can also be seamlessly adapted for other similar analyses. The GooFit fitter, running on GPUs, shows a remarkable improvement in the computing speed compared to a ROOT/RooFit implementation of the same analysis running on multi-core CPU clusters. Furthermore, it shows sensitivity to components with small contributions to the overall fit. It has the potential to be a powerful tool for sensitive and computationally intensive physics analyses.", "conferenceInfo": [], "keyword": ["High energy physics", "Flavour physics", "Search", "Exotic hadron spectroscopy", "GPU", "CUDA", "GooFit", "Unbinned maximum likelihood", "Fitting"]}, {"contentType": "Article", "identifier": "doi:10.1007/s11634-020-00434-3", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s11634-020-00434-3"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s11634-020-00434-3"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s11634-020-00434-3"}], "title": "PCA-KL: a parametric dimensionality reduction approach for unsupervised metric learning", "creators": [{"creator": "Levada, Alexandre L. M."}], "publicationName": "Advances in Data Analysis and Classification", "openaccess": "false", "doi": "10.1007/s11634-020-00434-3", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "1862-5347", "eIssn": "1862-5355", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Article"], "startingPage": "1", "endingPage": "40", "journalId": "11634", "onlineDate": "2021-01-07", "copyright": "©2021 Springer-Verlag GmbH Germany, part of Springer Nature", "abstract": "Dimensionality reduction algorithms are powerful mathematical tools for data analysis and visualization. In many pattern recognition applications, a feature extraction step is often required to mitigate the curse of the dimensionality, a collection of negative effects caused by an arbitrary increase in the number of features in classification tasks. Principal Component Analysis (PCA) is a classical statistical method that creates new features based on linear combinations of the original ones through the eigenvectors of the covariance matrix. In this paper, we propose PCA-KL, a parametric dimensionality reduction algorithm for unsupervised metric learning, based on the computation of the entropic covariance matrix, a surrogate for the covariance matrix of the data obtained in terms of the relative entropy between local Gaussian distributions instead of the usual Euclidean distance between the data points. Numerical experiments with several real datasets show that the proposed method is capable of producing better defined clusters and also higher classification accuracy in comparison to regular PCA and several manifold learning algorithms, making PCA-KL a promising alternative for unsupervised metric learning.", "conferenceInfo": [], "keyword": ["Dimensionality reduction", "PCA", "KL-divergence", "Unsupervised Metric learning", "62H30", "94A16", "94A17", "68T10"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05530-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05530-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05530-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05530-1"}], "title": "Toward hardware-aware deep-learning-based dialogue systems", "creators": [{"creator": "Pandelea, Vlad"}, {"creator": "Ragusa, Edoardo"}, {"creator": "Young, Tom"}, {"creator": "Gastaldo, Paolo"}, {"creator": "Cambria, Erik"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05530-1", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Issue on Effective and Efficient Deep Learning Based Solutions", "genre": ["OriginalPaper", "S.I. : Effective and Efficient Deep Learning "], "startingPage": "1", "endingPage": "12", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "In the past few years, the use of transformer-based models has experienced increasing popularity as new state-of-the-art performance was achieved in several natural language processing tasks. As these models are often extremely large, however, their use for applications within embedded devices may not be feasible. In this work, we look at one such specific application, retrieval-based dialogue systems, that poses additional difficulties when deployed in environments characterized by limited resources. Research on building dialogue systems able to engage in natural sounding conversation with humans has attracted increasing attention in recent years. This has led to the rise of commercial conversational agents, such as Google Home, Alexa and Siri situated on embedded devices, that enable users to interface with a wide range of underlying functionalities in a natural and seamless manner. In part due to memory and computational power constraints, these agents necessitate frequent communication with a server in order to process the users’ queries. This communication may act as a bottleneck, resulting in delays as well as in the halt of the system should the network connection be lost or unavailable. We propose a new framework for hardware-aware retrieval-based dialogue systems based on the Dual-Encoder architecture, coupled with a clustering method to group candidates pertaining to a same conversation, that reduces storage capacity and computational power requirements.", "conferenceInfo": [], "keyword": ["Dialogue systems", "Natural language processing", "Artificial intelligence"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00406-6", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00406-6"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00406-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00406-6"}], "title": "Sleep stage classification using extreme learning machine and particle swarm optimization for healthcare big data", "creators": [{"creator": "Surantha, Nico"}, {"creator": "Lesmana, Tri Fennia"}, {"creator": "Isa, Sani Muhamad"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00406-6", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "17", "journalId": "40537", "onlineDate": "2021-01-07", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Recent developments of portable sensor devices, cloud computing, and machine learning algorithms have led to the emergence of big data analytics in healthcare. The condition of the human body, e.g. the ECG signal, can be monitored regularly by means of a portable sensor device. The use of the machine learning algorithm would then provide an overview of a patient’s current health on a regular basis compared to a medical doctor’s diagnosis that can only be made during a hospital visit. This work aimed to develop an accurate model for classifying sleep stages by features of Heart Rate Variability (HRV) extracted from Electrocardiogram (ECG). The sleep stages classification can be utilized to predict the sleep stages proportion. Where sleep stages proportion information can provide an insight of human sleep quality. The integration of Extreme Learning Machine (ELM) and Particle Swarm Optimization (PSO) was utilized for selecting features and determining the number of hidden nodes. The results were compared to Support Vector Machine (SVM) and ELM methods which are lower than the integration of ELM with PSO. The results of accuracy tests for the combined ELM and PSO were 62.66%, 71.52%, 76.77%, and 82.1% respectively for 6, 4, 3, and 2 classes. To sum up, the classification accuracy can be improved by deploying PSO algorithm for feature selection.", "conferenceInfo": [], "keyword": ["Electrocardiogram", "Extreme learning machine", "Heart rate variability", "Particle swarm optimization", "Sleep stages"]}, {"contentType": "Article", "identifier": "doi:10.1007/s11634-020-00432-5", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s11634-020-00432-5"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s11634-020-00432-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s11634-020-00432-5"}], "title": "Functional data clustering by projection into latent generalized hyperbolic subspaces", "creators": [{"creator": "Sharp, Alex"}, {"creator": "Browne, Ryan"}], "publicationName": "Advances in Data Analysis and Classification", "openaccess": "false", "doi": "10.1007/s11634-020-00432-5", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "1862-5347", "eIssn": "1862-5355", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Article"], "startingPage": "1", "endingPage": "23", "journalId": "11634", "onlineDate": "2021-01-07", "copyright": "©2021 Springer-Verlag GmbH Germany, part of Springer Nature", "abstract": "We introduce a latent subpace model which facilitates model-based clustering of functional data. Flexible clustering is attained by imposing jointly generalized hyperbolic distributions on projections of basis expansion coefficients into group specific subspaces. The model acquires parsimony by assuming these subspaces are of relatively low dimension. Parameter estimation is done through a multicycle ECM algorithm. Application to simulated and real datasets illustrate competitive clustering capabilities, and demonstrate the models general applicability.", "conferenceInfo": [], "keyword": ["Model-based clustering", "Functional data analysis", "Dimension reduction", "Functional principal component analysis", "EM algorithm", "62R10"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05623-x", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05623-x"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05623-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05623-x"}], "title": "Some new hybrid hesitant fuzzy weighted aggregation operators based on Archimedean and Dombi operations for multi-attribute decision making", "creators": [{"creator": "Saha, Abhijit"}, {"creator": "Dutta, Debjit"}, {"creator": "Kar, Samarjit"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05623-x", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "24", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "Hesitant fuzzy set (HFS) is more flexible and general tool in comparison to fuzzy set theory. There is not yet reported an aggregation operator (AO) which can provide desirable generality, flexibility and compatibility in adjusting risk preferences while aggregating attribute values under hesitant fuzzy (HF) environment, although based on algebraic t -norm and t -conorm, Einstein t -norm and t -conorm, Hammacher t -norm and t -conorm, Dombi t -norm and t -conorm and Frank t -norm and t -conorm; weighted AOs have been developed earlier to attempt to meet above such eventualities. So, the primary objective of this paper is to develop some general, flexible as well as compatible AOs that can be exploited to solve MADM problems with HF information. From this perspective, at the very beginning, we develop new operations between HFEs by uniting the features of Archimedean and Dombi operations. Next, based on these operations, we develop HF Archimedean-Dombi weighted arithmetic and geometric AOs, HF Archimedean-Dombi ordered weighted arithmetic and geometric AOs and HF Archimedean-Dombi hybrid arithmetic and geometric AOs. We have shown that the existing HF-algebraic weighted AOs, HF-Einstein weighted AOs and HF-Hammacher weighted AOs are special cases of our developed AOs. We discuss in detail some intriguing properties of the proposed AOs. Next, we establish a procedure of MADM endowed by the proposed operators under HF environment. Then, we present a practical example concerning the personnel selection to gloss the decision steps of the proposed method. We also conduct a validity test to show that our proposed AOs are authentic and legal. Moreover, we exhibit a sensitivity investigation with diverse criteria weight sets to examine the stability of our proposed intriguing approach. Also, we draw attention toward a comparison between the existing decision-making methods with the proposed method to prove the superiority of our model.", "conferenceInfo": [], "keyword": ["Hesitant fuzzy set", "Archimedean and Dombi -norms and -conorms", "Archimedean–Dombi weighted aggregation operators", "Multi-attribute decision making"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05519-w", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05519-w"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05519-w"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05519-w"}], "title": "Blockchain for healthcare data management: opportunities, challenges, and future recommendations", "creators": [{"creator": "Yaqoob, Ibrar"}, {"creator": "Salah, Khaled"}, {"creator": "Jayaraman, Raja"}, {"creator": "Al-Hammadi, Yousof"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05519-w", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I. : Healthcare Analytics", "genre": ["ReviewPaper", "S.I. : Healthcare Analytics"], "startingPage": "1", "endingPage": "16", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "Today's healthcare data management systems are facing key challenges in terms of data transparency, traceability, immutability, audit, data provenance, flexible access, trust, privacy, and security. Also, a large portion of existing healthcare systems leveraged for managing data are centralized that pose potential risks of single point of failures in case of natural disasters. Blockchain is an emerging and disruptive decentralized technology that has the potential to significantly revolutionize, reshape, and transform the way data are being handled in healthcare industries. In this paper, we discuss how leveraging blockchain for healthcare data management systems can lead to stimulate innovations and bring major improvements. We present the key blockchain features and characteristics. We discuss the premier advantages of adopting blockchain technology along with opportunities for healthcare industries. We present recent on-going projects and case studies to show the practicality of blockchain technology for various healthcare applications. We identify and discuss important open research challenges hindering the successful adoption of blockchain in the healthcare sector. Finally, we outline several future research directions.", "conferenceInfo": [], "keyword": ["Blockchain", "Healthcare", "e-Health", "emHealth", "Healthcare data management"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00404-8", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00404-8"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00404-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00404-8"}], "title": "The effect of driver variables on the estimation of bivariate probability density of peak loads in long-term horizon", "creators": [{"creator": "Kaheh, Zohreh"}, {"creator": "Shabanzadeh, Morteza"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00404-8", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "17", "journalId": "40537", "onlineDate": "2021-01-07", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "It is evident that developing more accurate forecasting methods is the pillar of building robust multi-energy systems (MES). In this context, long-term forecasting is also indispensable to have a robust expansion planning program for modern power systems. While very short-term and short-term forecasting are usually represented with point estimation, this approach is highly unreliable in medium-term and long-term forecasting due to inherent uncertainty in predictors like weather variables in long terms. Accordingly, long-term forecasting is usually represented by probabilistic forecasting values which are based on probabilistic functions. In this paper, a self-organizing mixture network (SOMN) is developed to estimate the probability density function (PDF) of peak load in long-term horizons considering the most important drivers of seasonal similarity, population, gross domestic product (GDP), and electricity price. The proposed methodology is applied to forecast the PDF of annual and seasonal peak load in Queensland Australia.", "conferenceInfo": [], "keyword": ["Long-term forecasting", "Robust multi-energy systems", "Annual and seasonal peak load", "Self-organizing mixture network", "Probability density function", "Driver variables"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00402-w", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00402-w"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00402-w"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00402-w"}], "title": "A method for extracting travel patterns using data polishing", "creators": [{"creator": "Hosoe, Mio"}, {"creator": "Kuwano, Masashi"}, {"creator": "Moriyama, Taku"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00402-w", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "22", "journalId": "40537", "onlineDate": "2021-01-07", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "With recent developments in ICT, the interest in using large amounts of accumulated data for traffic policy planning has increased significantly. In recent years, data polishing has been proposed as a new method of big data analysis. Data polishing is a graphical clustering method, which can be used to extract patterns that are similar or related to each other by identifying the cluster structures present in the data. The purpose of this study is to identify the travel patterns of railway passengers by applying data polishing to smart card data collected in the Kagawa Prefecture, Japan. To this end, we consider 9,008,709 data points collected over a period of 15 months, ranging from December 1st, 2013 to February 28th, 2015. This dataset includes various types of information, including trip histories and types of passengers. This study implements data polishing to cluster 4,667,520 combinations of information regarding individual rides in terms of the day of the week, the time of the day, passenger types, and origin and destination stations. Via the analysis, 127 characteristic travel patterns are identified in aggregate.", "conferenceInfo": [], "keyword": ["Public transport", "Smart card", "High order data"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05588-x", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05588-x"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05588-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05588-x"}], "title": "Global research on artificial intelligence-enhanced human electroencephalogram analysis", "creators": [{"creator": "Chen, Xieling"}, {"creator": "Tao, Xiaohui"}, {"creator": "Wang, Fu Lee"}, {"creator": "Xie, Haoran"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05588-x", "publisher": "Springer", "publicationDate": "2021-01-07", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I. : Healthcare Analytics", "genre": ["ReviewPaper", "S.I. : Healthcare Analytics"], "startingPage": "1", "endingPage": "39", "journalId": "521", "onlineDate": "2021-01-07", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "The application of artificial intelligence (AI) technologies in assisting human electroencephalogram (EEG) analysis has become an active scientific field. This study aims to present a comprehensive review of the research field of AI-enhanced human EEG analysis. Using bibliometrics and topic modeling, research articles concerning AI-enhanced human EEG analysis collected from the Web of Science database during the period 2009–2018 were analyzed. After examining 2053 research articles published around the world, it was found that the annual number of articles had significantly grown from 78 to 468, with the USA and China being the most influential and prolific. The results of the keyword analysis showed that “electroencephalogram,” “brain–computer interface,” “classification,” “support vector machine,” “electroencephalography,” and “signal” were the most frequently used. The results of topic modeling and evolution analyses highlighted several important issues, including epileptic seizure detection , brain – machine interface , EEG classification , mental disorders , emotion , and alcoholism and anesthesia . The findings suggest that such visualization and analysis of the research articles could provide a comprehensive overview of the field for communities of practice and inquiry worldwide.", "conferenceInfo": [], "keyword": ["Artificial intelligence technologies", "Human brain", "Electroencephalogram", "Bibliometrics", "Research topics", "Visualization"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00395-6", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00395-6"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00395-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00395-6"}], "title": "Rating prediction of peer-to-peer accommodation through attributes and topics from customer review", "creators": [{"creator": "Subroto, Athor"}, {"creator": "Christianis, Marcel"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00395-6", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "29", "journalId": "40537", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "This study aims to predict customers’ behavior in classifying their reviews as high rated or low rated using associated attributes and topics found in the review. Knowing customer reviewing action better can lead to a successful strategy implementation of the relevant parties related to this study such as policy to manage customer reviews by keeping their satisfaction high. We applied a big data approach on a dataset of 55,377 reviews from Airbnb listings in the top 10 most visited cities in Indonesia (based on foreign arrivals data). We used The Classification and Regression Tree Model, Random Forest Model, Least Absolute Shrinkage and Selection Operation and Logistic Regression Model, Artificial Neural Network as well as Multi-Layer Perceptron to make prediction’s classification. Those models are used to identify a set of attributes and topics that will increase the chance of the review to render a high rate and a different set of attributes and topics that will lead the review to be low rated. This study found; first, attributes and topics that influence customers' odds to classify their review as high rated or low rated adhere to the understanding of Peer to Peer accommodation attributes. Second, successfully proved that customer reviews' attributes and topics could be used to predict the classification of ratings in Peer to Peer accommodation. Where for Topics, we can predict the rating using Random Forest yields 60.09% accuracy, slightly better than Artificial Neural Network (58.33%) and Multi-Layer Perceptron (58.8%). However, it seems better to use Attributes to predict the rating, where the accuracy is yielded better by applying Artificial Neural Network with 84.79% accuracy compared to Multi-Layer Perceptron with only 72.35% of accuracy.", "conferenceInfo": [], "keyword": ["Rating prediction", "Peer to peer accommodation", "Customer review", "Big data", "Sharing economy", "Tourism industry"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05628-6", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05628-6"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05628-6"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05628-6"}], "title": "Optimized ensemble of regression tree-based location of evolving faults in dual-circuit line", "creators": [{"creator": "Valabhoju, Ashok"}, {"creator": "Yadav, Anamika"}, {"creator": "Pazoki, Mohammad"}, {"creator": "El-Sehiemy, Ragab A."}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05628-6", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "26", "journalId": "521", "onlineDate": "2021-01-06", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "In a dual-circuit transmission line, the location of evolving faults (EVFs) is more tiresome due to its multifaceted nature. In this paper, a novel data-mining-based scheme is proposed for location of EVFs by using an ensemble of regression trees, that is, bagged regression trees and boosted regression trees. This ensemble of regression tree modules is trained with optimized hyperparameters such as minimum leaf size, leaning cycles, and learning rate by using Bayesian optimization. A practical power transmission network of Chhattisgarh state is modeled/simulated in MATLAB software to employ the proposed fault location scheme. Exclusive datasets are provided by performing extensive simulation studies at a wide range of fault scenarios, thereby applying discrete wavelet transform as an explanatory signal processing technique. Further performance assessment is carried out by comparing different error metrics such as mean absolute error, mean absolute relative error, mean square error, and root mean square error. The simulation results confirm the applicability of the proposed scheme for fault location estimation, and it makes a research insight while designing relaying schemes to practical power transmission networks.", "conferenceInfo": [], "keyword": ["Fault location", "Evolving faults (EVFs)", "Discrete wavelet transform (DWT)", "Dual-circuit transmission line (DCTL)", "Data-mining model", "Bagged regression tree (BGRT)", "Boosted regression tree (BSRT)"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00389-4", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00389-4"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00389-4"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00389-4"}], "title": "Bayesian zero-inflated regression model with application to under-five child mortality", "creators": [{"creator": "Workie, Mekuanint Simeneh"}, {"creator": "Azene, Abebaw Gedef"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00389-4", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "23", "journalId": "40537", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Under-five mortality is defined as the likelihood of a child born alive to die between birth and fifth birthday. Mortality of under the age of five has been the most targets of public health policies and may be a common indicator of mortality levels. Thus, this study aimed to assess the under-five child mortality and modeling Bayesian zero-inflated regression model of the determinants of under-five child mortality. A community-based cross-sectional study was conducted using the 2016 Ethiopia Demographic and Health Survey data. The sample was stratified and selected in a two-stage cluster sampling design. The Bayesian analytic approach was applied to model the mixture arrangement inherent in zero-inflated count data by using the negative Binomial–logit hurdle model. About 71.09% of the mothers had not faced any under-five deaths in their lifetime while 28.91% of the women experienced the death of their under-five children and the data were found to have excess zeros. From Bayesian Negative Binomial—logit hurdle model it was found that twin (OR = 1.56; HPD CrI 1.23, 1.94), Primary and Secondary education (OR = 0.68; HPD CrI 0.59, 0.79), mother’s age at the first birth: 16–25 (OR = 0.83; HPD CrI 0.75, 0.92) and ≥ 26 (OR = 0.71; HPD CrI 0.52, 0.95), using contraceptive method (OR = 0.73; HPD CrI 0.64, 0.84) and antenatal visits during pregnancy (OR = 0.83; HPD CrI 0.75, 0.92) were statistically associated with the number of non-zero under-five deaths in Ethiopia. The finding from the Bayesian Negative Binomial–logit hurdle model is getting popular in data analysis than the Negative Binomial–logit hurdle model because the technique is more robust and precise. Furthermore, Using the Bayesian Negative Binomial–logit hurdle model helps in selecting the most significant factor: mother’s education, Mothers age, Birth order, type of birth, mother’s age at the first birth, using a contraceptive method, and antenatal visits during pregnancy were the most important determinants of under-five child mortality.", "conferenceInfo": [], "keyword": ["Under-five death", "Bayesian approach", "Zero-inflated regression", "MCMC", "Ethiopia"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05615-x", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05615-x"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05615-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05615-x"}], "title": "Development of energy efficient drive for ventilation system using recurrent neural network", "creators": [{"creator": "Prince"}, {"creator": "Hati, Ananda Shankar"}, {"creator": "Chakrabarti, Prasun"}, {"creator": "Abawajy, Jemal H."}, {"creator": "Keong, Ng Wee"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05615-x", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "10", "journalId": "521", "onlineDate": "2021-01-06", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "This research article corroborates the working of a model reference adaptive model (MRAS) with fractional-order proportional-integral (FOPI $$^\\lambda $$ λ )-based encoderless speed control approach for ventilation system drive using recurrent neural network (RNN) for the low- and medium-range operation. The purpose of this study is to minimize the energy loss due to fluctuations and variation in the rotor speed and also find the optimum values of FOPI $$^\\lambda $$ λ by using a recurrent neural network to enhance the overall implementation of the system. In this perspective, the low-speed execution of MRAS is poor due to the existence of a pure integral and derivative parameter. Towards enhancement of the performance at speed region, a MRAS method with RNN is used. The network is trained using the Levenberg–Marquardt (LM) algorithm, and FOPI $$^\\lambda $$ λ control method is used for tuning the gain of proportional-integral of speed and current controller of the encoderless speed control of the ventilation drive. The presented RNN speed estimator with FOPI $$^\\lambda $$ λ controller has shown better performance and stability in transitory and stable operation as well as it also provides an enhancement in the overall efficiency of the ventilation drive. The validation of the presented algorithm is detailed experiments on a fully digitized 5.5 kW ventilation system using the Lab VIEW interface.", "conferenceInfo": [], "keyword": ["Recurrent neural network", "Ventilation system", "Sensor-less speed control", "FOPI\n                  "]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00391-w", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00391-w"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00391-w"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00391-w"}], "title": "Evaluation of the effectiveness and efficiency of state-of-the-art features and models for automatic speech recognition error detection", "creators": [{"creator": "El Hannani, Asmaa"}, {"creator": "Errattahi, Rahhal"}, {"creator": "Salmam, Fatima Zahra"}, {"creator": "Hain, Thomas"}, {"creator": "Ouahmane, Hassan"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00391-w", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "16", "journalId": "40537", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Speech based human-machine interaction and natural language understanding applications have seen a rapid development and wide adoption over the last few decades. This has led to a proliferation of studies that investigate Error detection and classification in Automatic Speech Recognition (ASR) systems. However, different data sets and evaluation protocols are used, making direct comparisons of the proposed approaches (e.g. features and models) difficult. In this paper we perform an extensive evaluation of the effectiveness and efficiency of state-of-the-art approaches in a unified framework for both errors detection and errors type classification. We make three primary contributions throughout this paper: (1) we have compared our Variant Recurrent Neural Network (V-RNN) model with three other state-of-the-art neural based models, and have shown that the V-RNN model is the most effective classifier for ASR error detection in term of accuracy and speed, (2) we have compared four features’ settings, corresponding to different categories of predictor features and have shown that the generic features are particularly suitable for real-time ASR error detection applications, and (3) we have looked at the post generalization ability of our error detection framework and performed a detailed post detection analysis in order to perceive the recognition errors that are difficult to detect.", "conferenceInfo": [], "keyword": ["Automatic Speech Recognition", "Confidence estimation", "ASR error detection", "ASR error type classification", "Recurrent Neural Network", "Multi-Genre Broadcast"]}, {"contentType": "Article", "identifier": "doi:10.1007/s13748-020-00229-9", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s13748-020-00229-9"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s13748-020-00229-9"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s13748-020-00229-9"}], "title": "Prescriptive analytics for impulsive behaviour prevention using real-time biometrics", "creators": [{"creator": "Raychaudhuri, Soumya Jyoti"}, {"creator": "Manjunath, Soumya"}, {"creator": "Srinivasan, Chithra Priya"}, {"creator": "Swathi, N."}, {"creator": "Sushma, S."}, {"creator": "Nitin Bhushan, K. N."}, {"creator": "Narendra Babu, C."}], "publicationName": "Progress in Artificial Intelligence", "openaccess": "false", "doi": "10.1007/s13748-020-00229-9", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "2192-6352", "eIssn": "2192-6360", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Regular Paper"], "startingPage": "1", "endingPage": "14", "journalId": "13748", "onlineDate": "2021-01-06", "copyright": "©2021 Springer-Verlag GmbH Germany, part of Springer Nature", "abstract": "The present biometric market segment has been captured by compact, lightweight sensors which are capable of reading the biometric fluctuations of a user in real-time. This biometric market segment has further facilitated rise of a new ecosystem of wearable devices helpful in tracking the real-time physiological data for Healthcare-related analysis. However, the devices in the smart-wearable ecosystem are limited to capturing and displaying the biometrics without any prescriptive analytics. This paper addresses this gap to analyse the human emotion space based on an individual’s state of mind over the past 60 min and employs Deep Learning and Bayesian prediction techniques to predict the possibility of an impulsive outburst within upcoming few minutes. A lightweight smart processing device mounted with sensors captures the biometrics of the user and calibrate the same to the mental state of the user on a scale of zero to hundred. The results reveal that the deep learning algorithm along with the Bayesian probability module can predict the future mood fluctuations of the user with lower error than the other contemporary models. The predicted mood fluctuations has matched with the actual mood changes of the experimental subject within $$ \\pm 10 $$ ± 10  min of the predicted time index in 93% of the cases and within $$ \\pm 5 $$ ± 5  min in 82% of the cases.", "conferenceInfo": [], "keyword": ["Artificial intelligence", "Biometrics", "Convolutional neural network", "Bayesian prediction", "Variational autoencoders"]}, {"contentType": "Article", "identifier": "doi:10.1007/s41666-020-00088-y", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s41666-020-00088-y"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s41666-020-00088-y"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s41666-020-00088-y"}], "title": "ALeRT-COVID: Attentive Lockdown-awaRe Transfer Learning for Predicting COVID-19 Pandemics in Different Countries", "creators": [{"creator": "Li, Yingxue"}, {"creator": "Jia, Wenxiao"}, {"creator": "Wang, Junmei"}, {"creator": "Guo, Jianying"}, {"creator": "Liu, Qin"}, {"creator": "Li, Xiang"}, {"creator": "Xie, Guotong"}, {"creator": "Wang, Fei"}], "publicationName": "Journal of Healthcare Informatics Research", "openaccess": "false", "doi": "10.1007/s41666-020-00088-y", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "2509-4971", "eIssn": "2509-498X", "volume": "", "number": "", "issueType": "", "topicalCollection": "Special Collection on COVID-19", "genre": ["OriginalPaper", "Research Article"], "startingPage": "1", "endingPage": "16", "journalId": "41666", "onlineDate": "2021-01-06", "copyright": "©2021 The Author(s), under exclusive licence to Springer Nature Switzerland AG part of Springer Nature", "abstract": "Countries across the world are in different stages of COVID-19 trajectory, among which many have implemented lockdown measures to prevent its spread. Although the lockdown is effective in such prevention, it may put the economy into a depression. Predicting the epidemic progression with the government switching the lockdown on or off is critical. We propose a transfer learning approach called ALeRT-COVID using attention-based recurrent neural network (RNN) architecture to predict the epidemic trends for different countries. A source model was trained on the pre-defined source countries and then transferred to each target country. The lockdown measure was introduced to our model as a predictor and the attention mechanism was utilized to learn the different contributions of the confirmed cases in the past days to the future trend. Results demonstrated that the transfer learning strategy is helpful especially for early-stage countries. By introducing the lockdown predictor and the attention mechanism, ALeRT-COVID showed a significant improvement in the prediction performance. We predicted the confirmed cases in 1 week when extending and easing lockdown separately. Our results show that lockdown measures are still necessary for several countries. We expect our research can help different countries to make better decisions on the lockdown measures.", "conferenceInfo": [], "keyword": ["COVID-19", "Transfer learning", "Lockdown measure", "Attention mechanism"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00405-7", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00405-7"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00405-7"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00405-7"}], "title": "Designing a Permissioned Blockchain Network for the Halal Industry using Hyperledger Fabric with multiple channels and the raft consensus mechanism", "creators": [{"creator": "Surjandari, Isti"}, {"creator": "Yusuf, Harman"}, {"creator": "Laoh, Enrico"}, {"creator": "Maulida, Rayi"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00405-7", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "16", "journalId": "40537", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Halal Supply Chain Management requires an assurance that the entire process of procurement, distribution, handling, and processing materials, spare parts, livestock, work-in-process, or finished inventory to be well documented and performed fit to the Halal and Toyyib. Blockchain technology is one alternative solution that can improve Halal Supply Chain as it can integrate technology for information exchange during the tracking and tracing process in operating and monitoring performance. This technology could improve trust, transparency, and information disclosure between supply chain participants since it could act as a distributed ledger and entitle all transactions to be completely open, yet confidential, immutable, and secured. This study uses a Blockchain Network with three channels and uses raft consensus algorithm in designing web interfaces and testing their capabilities. From the web interface, there were no failures in the validity test during the invoke test and the query test. In addition, the web interface was also successfully tested to thwart the formation of a block in case of data input errors from the user. The server can also do the process as a provider of information and validator for the web interface. From the results of simulations conducted on the Blockchain Network that was made, Blockchain’s transaction speed is fast and all the transaction is successfully transferred to other peers. Thus, Permissioned Blockchain is useful for Halal Supply Chain not just because it can secure transactions from some of the halal issues, but the transaction speed and rate to transfer data are very effective.", "conferenceInfo": [], "keyword": ["Blockchain", "Hyperledger Fabric", "Multiple channels", "Raft", "Halal Supply Chain"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05576-1", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05576-1"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05576-1"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05576-1"}], "title": "Retraction Note to: Computer-aided prediction of the Al_2O_3 nanoparticles’ effects on tensile strength and percentage of water absorption of concrete specimens", "creators": [{"creator": "Nazari, Ali"}, {"creator": "Riahi, Shadi"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05576-1", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["Erratum", "Correction"], "startingPage": "1", "endingPage": "1", "journalId": "521", "onlineDate": "2021-01-06", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "The Editor-in-Chief has retracted this article.", "conferenceInfo": []}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05655-3", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05655-3"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05655-3"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05655-3"}], "title": "Data-driven management for fuzzy sewage treatment processes using hybrid neural computing", "creators": [{"creator": "Zeng, Wenru"}, {"creator": "Guo, Zhiwei"}, {"creator": "Shen, Yu"}, {"creator": "Bashir, Ali Kashif"}, {"creator": "Yu, Keping"}, {"creator": "Al-Otaibi, Yasser D."}, {"creator": "Gao, Xu"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05655-3", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "S.I: Deep Neuro-Fuzzy Analytics for Intelligent Big Data Processing in Smart Ecosystems", "genre": ["OriginalPaper", "S.I. : Deep Neuro-Fuzzy Analytics in Smart Ecosystems"], "startingPage": "1", "endingPage": "14", "journalId": "521", "onlineDate": "2021-01-06", "copyright": "©2021 The Author(s), under exclusive licence to Springer-Verlag London Ltd. part of Springer Nature", "abstract": "With the growing public attention on sustainable development and green ecosystems, the efficient management of fuzzy sewage treatment processes (FSTPs) has been a major concern in academia. Characterized by strong abstraction and analysis abilities, data mining technologies provide a novel perspective to solve this problem. In recent years, data-driven management for FSTP has been widely investigated, resulting in a number of typical approaches. However, almost all existing technical approaches consider FSTP a unidirectional, sequential process, ignoring the bidirectional temporality caused by backflow operations. Therefore, we propose a data-driven management mechanism for FSTP based on hybrid neural computing (IM-HNC for short). This mechanism attempts to capture the bidirectional time-series features of FSTP with the aid of a bidirectional long short-term memory model, and further introduces a convolutional neural network to construct feature spaces with a stronger expression capability. Empirically, we implement a series of experiments on three datasets under different parameter settings to test the efficiency and robustness of the proposed IM-HNC. The experimental results manifest that the IM-HNC has an average performance improvement of approximately 5% compared to the baselines.", "conferenceInfo": [], "keyword": ["Data-driven management", "Fuzzy sewage treatment process", "Hybrid neural computing", "Bidirectional time-series features", "Green ecosystems"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00396-5", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00396-5"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00396-5"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00396-5"}], "title": "Analyzing Bangkok city taxi ride: reforming fares for profit sustainability using big data driven model", "creators": [{"creator": "Phiboonbanakit, Thananut"}, {"creator": "Horanont, Teerayut"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00396-5", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "27", "journalId": "40537", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "With the trend toward the use of large-scale vehicle probe data, an urban-scale analysis can now provide useful information for taxi drivers and passengers. Unfortunately, traffic congestion has become a critical problem in urban cities. Road traffic congestion reduces productivity in transportation services, and the daily profit earned is consequently reduced. This is opposite to the cost of living, which is increasing rapidly. Therefore, these issues are causing difficulties in all occupations in terms of managing daily expenses, particularly for taxi drivers. The taxi driving is classified as low income compared to other occupations. Such facts are a symbol of economic inefficiency. To this end, this study aims to assist taxi agencies and the government in improving taxi driver profits in Bangkok using large-scale data. To deal with these large-scale data, we propose a big data-driven model. With this model, we first calculate costs using a cost–distance algorithm and trip reconstruction. The data are then modeled to understand distance-based profits with respect to the departure time and traffic conditions. Finally, several cost predictive models using machine learning are evaluated using the ground truth from 50 taxis for a 1-month period. The experiment results show that more frequent trips over a short distance yield higher profits than long-distance trips. Finally, a solution to improve taxi driver profits is determined. We also compare the advantages and disadvantages of a unified solution.", "conferenceInfo": [], "keyword": ["Global positioning system", "Driving behavior", "Profit assessment", "Spatial–temporal analysis", "Big data"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00383-w", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00383-w"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00383-w"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00383-w"}], "title": "Querying knowledge graphs in natural language", "creators": [{"creator": "Liang, Shiqi"}, {"creator": "Stockinger, Kurt"}, {"creator": "Farias, Tarcisio Mendes"}, {"creator": "Anisimova, Maria"}, {"creator": "Gil, Manuel"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00383-w", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Research"], "startingPage": "1", "endingPage": "23", "journalId": "40537", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Knowledge graphs are a powerful concept for querying large amounts of data. These knowledge graphs are typically enormous and are often not easily accessible to end-users because they require specialized knowledge in query languages such as SPARQL. Moreover, end-users need a deep understanding of the structure of the underlying data models often based on the Resource Description Framework (RDF). This drawback has led to the development of Question-Answering (QA) systems that enable end-users to express their information needs in natural language. While existing systems simplify user access, there is still room for improvement in the accuracy of these systems. In this paper we propose a new QA system for translating natural language questions into SPARQL queries. The key idea is to break up the translation process into 5 smaller, more manageable sub-tasks and use ensemble machine learning methods as well as Tree-LSTM-based neural network models to automatically learn and translate a natural language question into a SPARQL query. The performance of our proposed QA system is empirically evaluated using the two renowned benchmarks-the 7th Question Answering over Linked Data Challenge (QALD-7) and the Large-Scale Complex Question Answering Dataset (LC-QuAD). Experimental results show that our QA system outperforms the state-of-art systems by 15% on the QALD-7 dataset and by 48% on the LC-QuAD dataset, respectively. In addition, we make our source code available.", "conferenceInfo": [], "keyword": ["Natural language processing", "Query processing", "Knowledge graphs", "SPARQL"]}, {"contentType": "Article", "identifier": "doi:10.1007/s00521-020-05553-8", "url": [{"format": "html", "platform": "web", "value": "http://link.springer.com/openurl/fulltext?id=doi:10.1007/s00521-020-05553-8"}, {"format": "pdf", "platform": "web", "value": "http://link.springer.com/openurl/pdf?id=doi:10.1007/s00521-020-05553-8"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/s00521-020-05553-8"}], "title": "Hybrid signal processing/machine learning and PSO optimization model for conjunctive management of surface–groundwater resources", "creators": [{"creator": "Zare, Mohammad"}, {"creator": "Koch, Manfred"}], "publicationName": "Neural Computing and Applications", "openaccess": "false", "doi": "10.1007/s00521-020-05553-8", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "0941-0643", "eIssn": "1433-3058", "volume": "", "number": "", "issueType": "", "topicalCollection": "", "genre": ["OriginalPaper", "Original Article"], "startingPage": "1", "endingPage": "22", "journalId": "521", "onlineDate": "2021-01-06", "copyright": "©2021 Springer-Verlag London Ltd., part of Springer Nature", "abstract": "Conjunctive management of surface–groundwater resources systems by means of mathematical optimization–simulation techniques becomes an important issue for sustainable water resources development, namely in water-scarce regions. In this study, the particle swarm optimization (PSO) method has been coupled with a hybrid wavelet/ANFIS–fuzzy C-means (FCM) simulation model to determine the optimal agricultural irrigation water allocation in the Miandarband plain, western Iran. Firstly, the optimal amount of conveyed water (CW) from the Gavoshan Dam into the plain is determined by constrained PSO. The constraints are the long-term minimum monthly exceedance streamflows that are estimated for different exceedance probabilities—with a 70% value found to best reflect the average annual river inflow of 3.4 m^3/s into the dam—using the two-parameter Weibull distribution as well as the classical Weibull nonparametric plotting position method. Then, based on the politically prioritized proportions of the dam’s allocated water for domestic, environmental and agricultural uses, as well as the share of the plain devoted to  agriculture, the optimal monthly CW available for the plain (= 112 MCM/a) is obtained. However, the subsequent estimation of the irrigation water request (IWR) (= 265.8 MCM/a), calculated by the FAO-56 method and using empirical crop coefficients of the present agricultural pattern in the plain, indicates that there is an irrigation water deficit of 153.1 MCM/a that must be made up by groundwater withdrawal (GW), in a way that neither waterlogging nor severe drop conditions in groundwater levels (GL) will occur. The latter are then calculated by the hybrid wavelet/ANFIS (FCM) model, wherefore good performance indicators R^2 and RMSE, equal to 0.98 and 0.21 m and 0.94 and 0.31 m in the training and testing phases, respectively, are obtained. Finally, PSO and the hybrid model are coupled to simulate the GL fluctuations—with the above GL constraints—under conjunctive use of the optimal surface (CW) and groundwater resources (GW) in the Miandarband plain. In conclusion, the innovative coupled simulation/optimization model turns out to be a very useful tool for optimal and sustainable conjunctive management of surface–groundwater resources in an irrigation area.", "conferenceInfo": [], "keyword": ["Conjunctive surface–groundwater management", "Hybrid wavelet/ANFIS–FCM model", "Particle swarm optimization", "Irrigation water requirement Miandarband plain", "Iran"]}, {"contentType": "Article", "identifier": "doi:10.1186/s40537-020-00394-7", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s40537-020-00394-7"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s40537-020-00394-7"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s40537-020-00394-7"}], "title": "Assessing the accuracy of record linkages with Markov chain based Monte Carlo simulation approach", "creators": [{"creator": "Haque, Shovanur"}, {"creator": "Mengersen, Kerrie"}, {"creator": "Stern, Steven"}], "publicationName": "Journal of Big Data", "openaccess": "true", "doi": "10.1186/s40537-020-00394-7", "publisher": "Springer", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2196-1115", "volume": "8", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Methodology"], "startingPage": "1", "endingPage": "25", "journalId": "40537", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2021 The Author(s)", "abstract": "Record linkage is the process of finding matches and linking records from different data sources so that the linked records belong to the same entity. There is an increasing number of applications of record linkage in statistical, health, government and business organisations to link administrative, survey, population census and other files to create a complete set of information for more complete and comprehensive analysis. To make valid inferences using a linked file, it has become increasingly important to have effective and efficient methods for linking data from different sources. Therefore, it becomes necessary to assess the ability of a linking method to achieve high accuracy or to compare between methods with respect to accuracy. This motivates the development of a method for assessing the linking process and facilitating decisions about which linking method is likely to be more accurate for a particular linking task. This paper proposes a Markov Chain based Monte Carlo simulation approach, MaCSim for assessing a linking method and illustrates the utility of the approach using a realistic synthetic dataset received from the Australian Bureau of Statistics to avoid privacy issues associated with using real personal information. A linking method applied by MaCSim is also defined. To assess the defined linking method, correct re-link proportions for each record are calculated using our developed simulation approach. The accuracy is determined for a number of simulated datasets. The analyses indicated promising performance of the proposed method MaCSim of the assessment of accuracy of the linkages. The computational aspects of the methodology are also investigated to assess its feasibility for practical use.", "conferenceInfo": [], "keyword": ["Record linkage", "Linkage accuracy", "Linking method", "Markov chain Monte Carlo", "Simulation", "Blocking"]}, {"contentType": "Article", "identifier": "doi:10.1186/s13326-020-00233-x", "url": [{"format": "html", "platform": "web", "value": "https://www.biomedcentral.com/openurl?doi=10.1186/s13326-020-00233-x"}, {"format": "pdf", "platform": "web", "value": "https://www.biomedcentral.com/openurl/pdf?id=doi:10.1186/s13326-020-00233-x"}, {"format": "", "platform": "", "value": "http://dx.doi.org/10.1186/s13326-020-00233-x"}], "title": "An ontology-based approach for developing a harmonised data-validation tool for European cancer registration", "creators": [{"creator": "Nicholson, Nicholas Charles"}, {"creator": "Giusti, Francesco"}, {"creator": "Bettio, Manola"}, {"creator": "Negrao Carvalho, Raquel"}, {"creator": "Dimitrova, Nadya"}, {"creator": "Dyba, Tadeusz"}, {"creator": "Flego, Manuela"}, {"creator": "Neamtiu, Luciana"}, {"creator": "Randi, Giorgia"}, {"creator": "Martos, Carmen"}], "publicationName": "Journal of Biomedical Semantics", "openaccess": "true", "doi": "10.1186/s13326-020-00233-x", "publisher": "BioMed Central", "publicationDate": "2021-01-06", "publicationType": "Journal", "issn": "", "eIssn": "2041-1480", "volume": "12", "number": "1", "issueType": "Regular", "topicalCollection": "", "genre": ["OriginalPaper", "Software"], "startingPage": "1", "endingPage": "15", "journalId": "13326", "onlineDate": "2021-01-06", "coverDate": "2021-12", "copyright": "©2020 The Author(s)", "abstract": "Background Population-based cancer registries constitute an important information source in cancer epidemiology. Studies collating and comparing data across regional and national boundaries have proved important for deploying and evaluating effective cancer-control strategies. A critical aspect in correctly comparing cancer indicators across regional and national boundaries lies in ensuring a good and harmonised level of data quality, which is a primary motivator for a centralised collection of pseudonymised data. The recent introduction of the European Union’s general data-protection regulation (GDPR) imposes stricter conditions on the collection, processing, and sharing of personal data. It also considers pseudonymised data as personal data. The new regulation motivates the need to find solutions that allow a continuation of the smooth processes leading to harmonised European cancer-registry data. One element in this regard would be the availability of a data-validation software tool based on a formalised depiction of the harmonised data-validation rules, allowing an eventual devolution of the data-validation process to the local level. Results A semantic data model was derived from the data-validation rules for harmonising cancer-data variables at European level. The data model was encapsulated in an ontology developed using the Web-Ontology Language (OWL) with the data-model entities forming the main OWL classes. The data-validation rules were added as axioms in the ontology. The reasoning function of the resulting ontology demonstrated its ability to trap registry-coding errors and in some instances to be able to correct errors. Conclusions Describing the European cancer-registry core data set in terms of an OWL ontology affords a tool based on a formalised set of axioms for validating a cancer-registry’s data set according to harmonised, supra-national rules. The fact that the data checks are inherently linked to the data model would lead to less maintenance overheads and also allow automatic versioning synchronisation, important for distributed data-quality checking processes.", "conferenceInfo": [], "keyword": ["Cancer registry", "Ontology", "Data validation", "Data federation", "Semantic web", "Data harmonisation"]}], "facets": [{"name": "subject", "values": [{"value": "Data Mining and Knowledge Discovery", "count": "113646"}, {"value": "Computer Science", "count": "96306"}, {"value": "Artificial Intelligence (incl. Robotics)", "count": "53447"}, {"value": "Information Systems Applications (incl. Internet)", "count": "46113"}, {"value": "Information Storage and Retrieval", "count": "39131"}, {"value": "Database Management", "count": "32139"}, {"value": "Computer Communication Networks", "count": "21599"}, {"value": "Pattern Recognition", "count": "20158"}, {"value": "Image Processing and Computer Vision", "count": "19802"}, {"value": "Algorithm Analysis and Problem Complexity", "count": "15217"}, {"value": "Artificial Intelligence", "count": "14996"}, {"value": "User Interfaces and Human Computer Interaction", "count": "11394"}, {"value": "Computational Biology/Bioinformatics", "count": "10789"}, {"value": "Engineering", "count": "10469"}, {"value": "Computational Intelligence", "count": "10006"}, {"value": "Computer Imaging, Vision, Pattern Recognition and Graphics", "count": "8538"}, {"value": "Simulation and Modeling", "count": "8034"}, {"value": "Computation by Abstract Devices", "count": "7641"}, {"value": "Multimedia Information Systems", "count": "7564"}, {"value": "Probability and Statistics in Computer Science", "count": "6846"}]}, {"name": "keyword", "values": [{"value": "Machine learning", "count": "1614"}, {"value": "Classification", "count": "1350"}, {"value": "Deep learning", "count": "1323"}, {"value": "Data mining", "count": "1078"}, {"value": "Clustering", "count": "1068"}, {"value": "Big data", "count": "738"}, {"value": "Ontology", "count": "613"}, {"value": "Feature selection", "count": "607"}, {"value": "Neural network", "count": "545"}, {"value": "Neural networks", "count": "486"}, {"value": "Cloud computing", "count": "474"}, {"value": "Optimization", "count": "469"}, {"value": "Genetic algorithm", "count": "464"}, {"value": "Sentiment analysis", "count": "458"}, {"value": "Feature extraction", "count": "429"}, {"value": "Natural language processing", "count": "393"}, {"value": "Social media", "count": "389"}, {"value": "SVM", "count": "383"}, {"value": "Social networks", "count": "374"}, {"value": "Twitter", "count": "364"}]}, {"name": "pub", "values": [{"value": "Neural Computing and Applications", "count": "4851"}, {"value": "Encyclopedia of Database Systems", "count": "2859"}, {"value": "Neural Information Processing", "count": "2460"}, {"value": "Encyclopedia of Social Network Analysis and Mining", "count": "1581"}, {"value": "Database Systems for Advanced Applications", "count": "1462"}, {"value": "Advances in Information Retrieval", "count": "1339"}, {"value": "Advances in Knowledge Discovery and Data Mining", "count": "1298"}, {"value": "Intelligent Information and Database Systems", "count": "1283"}, {"value": "Machine Learning and Knowledge Discovery in Databases", "count": "1283"}, {"value": "Database and Expert Systems Applications", "count": "1130"}, {"value": "Encyclopedia of Machine Learning and Data Mining", "count": "1114"}, {"value": "Encyclopedia of Machine Learning", "count": "892"}, {"value": "Data Mining and Knowledge Discovery", "count": "872"}, {"value": "Advanced Data Mining and Applications", "count": "792"}, {"value": "Computational Linguistics and Intelligent Text Processing", "count": "749"}, {"value": "Knowledge-Based Intelligent Information and Engineering Systems", "count": "735"}, {"value": "Foundations of Intelligent Systems", "count": "732"}, {"value": "Social Network Analysis and Mining", "count": "703"}, {"value": "Advances in Swarm Intelligence", "count": "647"}, {"value": "Advances in Artificial Intelligence", "count": "623"}]}, {"name": "year", "values": [{"value": "2021", "count": "1395"}, {"value": "2020", "count": "7896"}, {"value": "2019", "count": "8883"}, {"value": "2018", "count": "12598"}, {"value": "2017", "count": "9865"}, {"value": "2016", "count": "9751"}, {"value": "2015", "count": "7678"}, {"value": "2014", "count": "7995"}, {"value": "2013", "count": "7434"}, {"value": "2012", "count": "7835"}, {"value": "2011", "count": "6780"}, {"value": "2010", "count": "6268"}, {"value": "2009", "count": "7428"}, {"value": "2008", "count": "5455"}, {"value": "2007", "count": "5373"}, {"value": "2006", "count": "530"}, {"value": "2005", "count": "228"}, {"value": "2004", "count": "46"}, {"value": "2003", "count": "66"}, {"value": "2002", "count": "64"}]}, {"name": "country", "values": [{"value": "China", "count": "21437"}, {"value": "United States", "count": "14843"}, {"value": "India", "count": "9546"}, {"value": "Germany", "count": "8176"}, {"value": "United Kingdom", "count": "6142"}, {"value": "Japan", "count": "5368"}, {"value": "France", "count": "5210"}, {"value": "Italy", "count": "5183"}, {"value": "Spain", "count": "4859"}, {"value": "Australia", "count": "4698"}, {"value": "Canada", "count": "3500"}, {"value": "Poland", "count": "3390"}, {"value": "South Korea", "count": "2602"}, {"value": "Netherlands", "count": "2207"}, {"value": "Brazil", "count": "2092"}, {"value": "Greece", "count": "1883"}, {"value": "Taiwan", "count": "1677"}, {"value": "Portugal", "count": "1675"}, {"value": "Austria", "count": "1417"}, {"value": "Malaysia", "count": "1416"}]}, {"name": "type", "values": [{"value": "Book", "count": "103013"}, {"value": "Journal", "count": "10633"}]}]}